export const CommonIntlMessageCodesBangla= {
       920: "সফলভাবে নিষ্ক্রিয় করা হয়েছে",
        921: "সফলভাবে সক্রিয় করা হয়েছে",
        922: "সফলভাবে আপডেট করা হয়েছে",
        923: "সফলভাবে তৈরি করা হয়েছে",
        924: "কোনও তথ্য পাওয়া যায়নি",
        925: "ইতিমধ্যেই বিদ্যমান",
        965: "তথ্য পাওয়া যায়নি",
        930: "কাজ সফলভাবে যোগ করা হয়েছে",
        933: "ডিসপ্যাচ ইতিমধ্যে সম্পন্ন হয়েছে।",
        935: "অনুরোধে কোনও ডকেট দেওয়া হয়নি",
        936: "কাট ডিসপ্যাচ অনুরোধ সফলভাবে সংরক্ষণ করা হয়েছে",
        967: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
        968: "অভ্যন্তরীণ সার্ভার ত্রুটি",
        969: "তথ্য সফলভাবে আনা হয়েছে"
      }
      