export const CommonIntlMessageCodesSingla= {
    920: "සාර්ථකව අක්‍රීය කර ඇත",
    921: "සාර්ථකව සක්‍රීය කර ඇත",
    922: "සාර්ථකව යාවත්කාලීන කර ඇත",
    923: "සාර්ථකව නිර්මාණය කරන ලදී",
    924: "දත්ත කිසිවක් හමු නොවීය",
    925: "දැනටමත් පවතී",
    965: "දත්ත හමු නොවීය",
    930: "කාර්යය සාර්ථකව එක් කරන ලදී",
    933: "නියෝජනය දැනටමත් සිදු කර ඇත.",
    935: "අයදුම්පතේ කිසිදු ලේඛනයක් ලබාදී නොමැත",
    936: "කට් නියෝජන ඉල්ලීම සාර්ථකව සුරකින ලදී",
    967: "දත්ත සාර්ථකව ලබාගන්නා ලදී",
    968: "අභ්‍යන්තර සේවාදායක දෝෂයක්",
    969: "දත්ත සාර්ථකව ලබාගන්නා ලදී"
  }
  