export const fgwhIntlMessageCodesSinhala = {
//FgRacksService  
//fgwh → 46001-51000  

46001: "රාක් කේතය දැනටමත් තිබේ, කරුණාකර පරීක්ෂා කරන්න." , 
46002: 'රාක් ${reqModel.id ? "යාවත්කාලීන" } සාර්ථකව'  ,
46003: 'රාක් ${reqModel.id ? "සාදන ලදි"} සාර්ථකව' , 
46004: 'රාක් සාර්ථකව අක්‍රිය කරන ලදි'  ,
46005: 'රාක් සාර්ථකව සක්‍රිය කරන ලදි' , 

//FgLocationsService  

46006: "ස්ථාන කේතය දැනටමත් තිබේ, කරුණාකර පරීක්ෂා කරන්න." , 
46007: 'ස්ථාන ${reqModel.id ? "යාවත්කාලීන" } සාර්ථකව' , 
46008: 'ස්ථාන ${reqModel.id ? "සාදන ලදි"} සාර්ථකව' , 
46009: 'කරුණාකර ස්ථාන හැඳුනුම්පත ලබාදෙන්න',  
46010: 'ස්ථානය නොපවතී'  ,
46011: '{palletsInLocation.length} පෑලට් මෙහි පවතී. අක්‍රිය කළ නොහැක'  ,
46012: '${trolleysInLocation.length} ට්රොලී මෙහි පවතී. අක්‍රිය කළ නොහැක' , 
46013: 'ස්ථාන සාර්ථකව අක්‍රිය කරන ලදි'  ,
46014: 'ස්ථාන සාර්ථකව සක්‍රිය කරන ලදි'  ,
46015: 'ස්ථාන ${toggle.affected} සාර්ථකව යාවත්කාලීන කරන ලදි' , 
46016: "ස්ථාන දත්ත සාර්ථකව ලබාගන්නා ලදි" , 
46017: 'රාක් නොපවතී'  ,
46018: 'රාක් සහ ස්ථාන තොරතුරු ලබාගන්නා ලදි' , 
46019: 'කන්ටේනර් ${reqModel.id ? "යාවත්කාලීන" } සාර්ථකව',  
46020: 'කන්ටේනර් ${reqModel.id ? "සාදන ලදි"} සාර්ථකව'  ,
46021: 'කන්ටේනර් සාර්ථකව අක්‍රිය කරන ලදි'  ,
46022: 'කන්ටේනර් සාර්ථකව සක්‍රිය කරන ලදි'  ,
46023: 'කිසිඳු කන්ටේනර් තොරතුරු නොමැත'  ,

//FgWarehouseReqService  

46024: "සාර්ථකව සාදන ලදි"  ,
46025: 'දත්ත ලබාගන්නා ලදි'  ,
46026: "මෙම ශීර්ෂයට කිසිඳු පේළි නොමැත" , 
46027: "Fg ගබඩා පේළි සාර්ථකව ලබාගන්නා ලදි" , 
46028: "යාවත්කාලීන කිරීමට ඉල්ලීමේ හැඳුනුම්පත නොපවතී"  ,
46029: "ආරක්ෂණ විස්තර සාර්ථකව යාවත්කාලීන කරන ලදි" , 
46030: "ශීර්ෂ ඉල්ලීමේ හැඳුනුම්පත සඳහා කිසිඳු පැක්ලිස්ට් නොමැත",  
46031: "කරුණාකර FG ගබඩා ඉල්ලීම් සාදන්න"  ,
//FgWarehouseBarcodeScanningService

46032: 'කාටන් බාර්කෝඩය හමු නොවීය හෝ දැනටමත් ස්කෑන් කර ඇත. කරුණාකර පරීක්ෂා කරන්න',
46033: 'නිශ්චිත කන්ටේනර් කාටන් සඳහා FG ඉල්ලීමක් නොමැත',
46034: 'ස්ථානය සාර්ථකව සිතියම්ගත කරන ලදි',
46035: "මූලික අවස්ථාව සාර්ථකව ආරම්භ කරන ලදි!",
46036: "මූලික අවස්ථාව ආරම්භ නොවීය",

//FgWarehouseInfoService

46037: 'නියමිත පැක් ලිස්ට් හැඳුනුම්පත් සඳහා ගබඩා ඉල්ලීම් හමු නොවීය',
46038: 'ගබඩා ඉල්ලීමේ විස්තර සාර්ථකව ලබාගන්නා ලදි',
46039: 'ගබඩා සමූහ තොරතුරු සාර්ථකව ලබාගන්නා ලදි',
46040: 'පැමිණීම සහ ඇනවුම් යැවීමේ විස්තර සාර්ථකව ලබාගන්නා ලදි',

//FgContainerDataService

//CartonContainerMappingService

46041: 'කන්ටේනර් සඳහා වෙන්කරන ලද කාටන් ඇත',
46042: 'කාටන් කන්ටේනර් වෙන්කිරීමේ වලංගුකරණ තොරතුරු ලබාගන්නා ලදි',
46043: 'කන්ටේනර් ධාරිතාවය දැනටමත් පිරී ඇත: වැඩි කාටන් එකතු කළ නොහැක',
46044: 'පද්ධතිය නිර්දේශ කළ කන්ටේනර් සහ ආගමන කන්ටේනර් නොගැළපේ',
46045: 'විවිධ කාණ්ඩ අංක සහිත කාටන් එකම කන්ටේනර් එකකට ලබාදිය නොහැක',
46046: 'ඔබ ස්කෑන් කරන වත්මන් කාටනය ඔබ තෝරාගත් වත්මන් කන්ටේනරයේ දැනටමත් පවතී',
46047: 'කාටන් සාර්ථකව කන්ටේනරයට සිතියම්ගත කරන ලදි',
46048: 'කාටන් ප්‍රමාණය නිකුත් කරන ලදි',

46049: 'දික්කසාදය. ලබාදුන් බාර්කෝඩ්ය සමඟ කාටන් හමු නොවීය',

//ContainerGroupCreationService

46050: 'පැක් ලිස්ට් සඳහා දැනටමත් කන්ටේනර් සමූහ සාදන ලදි',
46051: 'කන්ටේනර් සමූහ සාර්ථකව සාදන ලදි',

//FGContainerGroupInfoService

46052: 'පැක් ලිස්ට් සඳහා PGS ලබාගන්නා ලදි',
46053: 'කාටන් කිසිඳු කන්ටේනර් සමූහයකට සිතියම්ගත කර නැත',
46054: 'කිසිඳු කන්ටේනර් සමූහයක් හමු නොවීය:',

//ContainerInfoService

46055: 'කන්ටේනර් නොපවතී',
46056: 'පැක් ලිස්ට් සඳහා කිසිඳු කන්ටේනර් සිතියම්ගත කර නැත',
46057: 'මෙම කන්ටේනරයට කිසිඳු කාටන් නොමැත',
46058: 'කන්ටේනර් සඳහා කාටන් ලබාගන්නා ලදි',
46059: 'කන්ටේනර් සහ ස්ථාන තොරතුරු හමු නොවීය',
46060: 'ට්‍රේ සහ කාටන් පද්ධතිය සාර්ථකව ලබාගන්නා ලදි',

//ContainerLocationMappingService

46061: 'පද්ධතිය නිර්දේශ කළ ස්ථානයට වෙනස් ස්ථානයකට වෙන් කිරීමට උත්සාහ කරයි',
46062: 'කන්ටේනරය දැනටමත් වත්මන් ස්ථානයේ තිබේ',
46063: 'අනුමැතියක් නොමැතිව පමණක් නිර්දේශිත ස්ථානයට කන්ටේනර් තැබිය හැක',
46064: 'කන්ටේනරය ස්ථානයට සිතියම්ගත කරන ලදි',

46065: 'කන්ටේනරය දැනටමත් ස්ථානයකට තහවුරු කර ඇත',
46066: 'කන්ටේනරය දැනටමත් එම ස්ථානයට සිතියම්ගත කර ඇත',
46067: 'කන්ටේනරය නිර්දේශිත ස්ථානයට සිතියම්ගත කරන ලදි',

46068: 'කන්ටේනර් ස්ථානයට සිතියම්ගත කරන ලදි',
46069: 'කන්ටේනරය සාර්ථකව ඉවත් කරන ලදි',

//LocationAllocationService

46070: 'කාටන් හැඳුනුම්පත් ලබාදී නොමැත',
46071: 'කාටන් ස්ථාන තොරතුරු සාර්ථකව ලබාගන්නා ලදි',

//LocationInfoService

46072: 'ස්ථාන තොරතුරු ලබාගන්නා ලදි',
46073: 'පැක් ලිස්ට් සඳහා කිසිඳු කන්ටේනර් සිතියම්ගත කර නැත',
46074: 'පැක් ලිස්ට් සඳහා කිසිඳු ස්ථානය සිතියම්ගත කර නැත',
46075: 'ස්ථාන තොරතුරු සාර්ථකව ලබාගන්නා ලදි',
46076: 'ස්ථාන සාර්ථකව ලබාගන්නා ලදි',

// LocationMappingHelperService

46077: 'ලබාදී ඇති කාටන් නොපවතී',
46078: 'තෝරාගත් කන්ටේනර් නොපවතී',
46079: 'තෝරාගත් ස්ථානය නොපවතී',

//WareHouseService

46080: 'ගබඩා වර්ගය සාර්ථකව සුරකින ලදි',
46081: "ගබඩා කේතය දැනටමත් පවතී",
46082: 'ගබඩා යාවත්කාලීන කිරීම සාර්ථකයි',
46083: 'ගබඩා සාර්ථකව සාදන ලදි',
46084: 'ගබඩා දත්ත සාර්ථකව ලබාගන්නා ලදි',

//Locations service

46085: 'ස්ථාන ${opCount.affected} සාර්ථකව යාවත්කාලීන කරන ලදි',

// FG Container Data Service

46086: "කන්ටේනර් කේතය දැනටමත් පවතී.",
46087: "සාර්ථකව යාවත්කාලීන කරන ලදි",
46088: "යාවත්කාලීන කිරීමට කිසිඳු දත්ත නොමැත",
46089: 'කාටන් බාර්කෝඩය හමු නොවීය හෝ දැනටමත් ස්කෑන් කර ඇත. කරුණාකර පරීක්ෂා කරන්න',
46090: 'බාර්කෝඩය දැනටමත් ස්කෑන් කර ඇත',
46091: 'කන්ටේනර් තොරතුරු ලබාගන්නා ලදි',
46092: 'කන්ටේනරයට කිසිඳු කාටන් නොමැත',
46093: 'පැක් ලිස්ට් සඳහා කාටන් ලබාගන්නා ලදි',
46094: 'කරුණාකර කන්ටේනර් තෝරන්න',
46095: 'පැක් ලිස්ට් සඳහා තහවුරු කරන ලද කන්ටේනර් නොමැත',
46096: 'ස්ථාන ධාරිතාවය දැනටමත් පිරී ඇත. වැඩි කන්ටේනර් තැබිය නොහැක',
46097: 'ස්ථාන, කන්ටේනර්, සහ කාටන් තොරතුරු ලබාගන්නා ලදි',















    
}