export const FgwhIntlMessageCodesbangla = {
//FgRacksService  
//fgwh → 46001-51000  

46001: "র্যাক কোড ইতিমধ্যে বিদ্যমান, অনুগ্রহ করে যাচাই করুন।"  ,
46002: 'র্যাক ${reqModel.id ? "আপডেট" } সফলভাবে'  ,
46003: 'র্যাক ${reqModel.id ? "তৈরি"} সফলভাবে',  
46004: 'র্যাক সফলভাবে নিষ্ক্রিয় করা হয়েছে'  ,
46005: 'র্যাক সফলভাবে সক্রিয় করা হয়েছে' , 

//FgLocationsService  

46006: "লোকেশন কোড ইতিমধ্যে বিদ্যমান, অনুগ্রহ করে যাচাই করুন।" , 
46007: 'লোকেশন ${reqModel.id ? "আপডেট" } সফলভাবে'  ,
46008: 'লোকেশন ${reqModel.id ? "তৈরি"} সফলভাবে' , 
46009: 'অনুগ্রহ করে লোকেশন আইডি প্রদান করুন'  ,
46010: 'লোকেশন বিদ্যমান নেই'  ,
46011: '{palletsInLocation.length}টি প্যালেট অবস্থানে উপস্থিত রয়েছে। নিষ্ক্রিয় করা যাবে না' , 
46012: '${trolleysInLocation.length}টি ট্রলি অবস্থানে উপস্থিত রয়েছে। নিষ্ক্রিয় করা যাবে না' , 
46013: 'লোকেশন সফলভাবে নিষ্ক্রিয় করা হয়েছে' , 
46014: 'লোকেশন সফলভাবে সক্রিয় করা হয়েছে' , 
46015: 'লোকেশন ${toggle.affected} সফলভাবে আপডেট হয়েছে'  ,
46016: "লোকেশন তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে"  ,
46017: 'র্যাক বিদ্যমান নেই'  ,
46018: 'র্যাক এবং লোকেশন তথ্য পুনরুদ্ধার হয়েছে'  ,
46019: 'কন্টেইনার ${reqModel.id ? "আপডেট" } সফলভাবে'  ,
46020: 'কন্টেইনার ${reqModel.id ? "তৈরি"} সফলভাবে' , 
46021: 'কন্টেইনার সফলভাবে নিষ্ক্রিয় করা হয়েছে'  ,
46022: 'কন্টেইনার সফলভাবে সক্রিয় করা হয়েছে',  
46023: 'কোনো কন্টেইনার তথ্য পাওয়া যায়নি'  ,

//FgWarehouseReqService  

46024: "সফলভাবে তৈরি হয়েছে"  ,
46025: 'তথ্য পুনরুদ্ধার হয়েছে'  ,
46026: "এই শিরোনামের জন্য কোনো লাইন নেই"  ,
46027: "FG Warehouse লাইনের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে"  ,
46028: "আপডেট করার জন্য অনুরোধ আইডি পাওয়া যায়নি" , 
46029: "নিরাপত্তা বিবরণ সফলভাবে আপডেট হয়েছে" , 
46030: "শিরোনাম অনুরোধ আইডির জন্য কোনো প্যাকলিস্ট পাওয়া যায়নি"  ,
46031: "অনুগ্রহ করে FG Warehouse অনুরোধ তৈরি করুন"  ,
//FgWarehouseBarcodeScanningService

46032: 'কার্টন বারকোড পাওয়া যায়নি বা ইতিমধ্যে স্ক্যান করা হয়েছে। অনুগ্রহ করে যাচাই করুন',
46033: 'প্রদত্ত কন্টেইনার কার্টনের জন্য FG অনুরোধ উপলব্ধ নয়',
46034: 'লোকেশন সফলভাবে ম্যাপ করা হয়েছে',
46035: "সেশন সফলভাবে শুরু হয়েছে!",
46036: "সেশন শুরু হয়নি",

//FgWarehouseInfoService
46037: 'প্রদত্ত প্যাক লিস্ট আইডির জন্য গুদাম অনুরোধ পাওয়া যায়নি',
46038: 'গুদাম অনুরোধের বিবরণ সফলভাবে পুনরুদ্ধার হয়েছে',
46039: 'গুদাম গ্রুপের তথ্য সফলভাবে প্রাপ্ত হয়েছে',
46040: 'আগমন এবং প্রেরণ বিবরণ সফলভাবে পুনরুদ্ধার হয়েছে',

//FgContainerDataService

//CartonContainerMappingService
46041: 'কন্টেইনারে ইতিমধ্যে নির্দিষ্ট কার্টন রয়েছে',
46042: 'কার্টন কন্টেইনার বরাদ্দের বৈধতা সংক্রান্ত তথ্য পুনরুদ্ধার হয়েছে',
46043: 'কন্টেইনার ধারণক্ষমতা ইতিমধ্যে পূর্ণ: আপনি আরও কার্টন যোগ করতে পারবেন না',
46044: 'সিস্টেম প্রস্তাবিত এবং আগত কন্টেইনার মেলে না',
46045: 'ভিন্ন ব্যাচ নম্বর সহ কার্টন একই কন্টেইনারে বরাদ্দ করা যাবে না',
46046: 'আপনি যে কার্টনটি স্ক্যান করছেন তা ইতিমধ্যেই নির্বাচিত কন্টেইনারে রয়েছে',
46047: 'কার্টন সফলভাবে কন্টেইনারে ম্যাপ করা হয়েছে',
46048: 'কার্টন পরিমাণ ইস্যু করা হয়েছে',

46049: 'প্রদত্ত বারকোড সহ কার্টন পাওয়া যায়নি',

//ContainerGroupCreationService
46050: 'প্যাক লিস্টের জন্য কন্টেইনার গ্রুপ ইতিমধ্যেই তৈরি করা হয়েছে',
46051: 'কন্টেইনার গ্রুপ সফলভাবে তৈরি হয়েছে',

//FGContainerGroupInfoService
46052: 'প্যাক লিস্টের জন্য PGS সফলভাবে পুনরুদ্ধার হয়েছে',
46053: 'এই কার্টনটি কোনো কন্টেইনার গ্রুপের সাথে ম্যাপ করা হয়নি',
46054: 'এর জন্য কোনো কন্টেইনার গ্রুপ পাওয়া যায়নি:',

//ContainerInfoService
46055: 'কন্টেইনার বিদ্যমান নেই',
46056: 'প্যাকিং লিস্টের জন্য কোনো কন্টেইনার ম্যাপ করা হয়নি',
46057: 'এই কন্টেইনারের জন্য কোনো কার্টন ম্যাপ করা হয়নি',
46058: 'কন্টেইনারের জন্য কার্টন পুনরুদ্ধার হয়েছে',
46059: 'কন্টেইনার এবং লোকেশন সম্পর্কিত তথ্য পাওয়া যায়নি',
46060: 'ট্রে এবং কার্টনের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',

//ContainerLocationMappingService
46061: 'সিস্টেম প্রস্তাবিত অবস্থানের চেয়ে ভিন্ন স্থানে বরাদ্দ করার চেষ্টা করা হচ্ছে',
46062: 'কন্টেইনার ইতিমধ্যে বর্তমান অবস্থানে রাখা হয়েছে',
46063: 'অনুমোদন ছাড়া শুধুমাত্র প্রস্তাবিত অবস্থানে কন্টেইনার স্থাপন করা যাবে',
46064: 'কন্টেইনার সফলভাবে অবস্থানের সাথে ম্যাপ করা হয়েছে',

46065: 'কন্টেইনার ইতিমধ্যে একটি অবস্থানে নিশ্চিত করা হয়েছে',
46066: 'কন্টেইনার ইতিমধ্যে একই অবস্থানের সাথে ম্যাপ করা হয়েছে',
46067: 'কন্টেইনার প্রস্তাবিত অবস্থানের সাথে ম্যাপ করা হয়েছে',

46068: 'কন্টেইনার অবস্থানের সাথে ম্যাপ করা হয়েছে',

46069: 'কন্টেইনার সফলভাবে আনম্যাপ করা হয়েছে',

//LocationAllocationService
46070: 'কার্টনের আইডি প্রদান করা হয়নি',
46071: 'কার্টন অবস্থানের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',

//LocationInfoService
46072: 'লোকেশন তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',
46073: 'প্যাকিং লিস্টের জন্য কোনো কন্টেইনার ম্যাপ করা হয়নি',
46074: 'প্যাকিং লিস্টের জন্য কোনো লোকেশন ম্যাপ করা হয়নি',
46075: 'লোকেশন তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',

46076: 'লোকেশন সফলভাবে পুনরুদ্ধার হয়েছে',

//LocationMappingHelperService
46077: 'প্রদত্ত কার্টন বিদ্যমান নেই',
46078: 'নির্বাচিত কন্টেইনার বিদ্যমান নেই',
46079: 'নির্বাচিত অবস্থান বিদ্যমান নেই',

//WareHouseService
46080: 'গুদামের ধরন সফলভাবে সংরক্ষিত হয়েছে',
46081: "গুদামের কোড ইতিমধ্যেই বিদ্যমান।",
46082: 'গুদামের তথ্য সফলভাবে আপডেট হয়েছে',
46083: 'গুদাম সফলভাবে তৈরি হয়েছে',
46084: 'গুদামের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',

//Locations Service
46085: 'লোকেশন ${opCount.affected} সফলভাবে আপডেট হয়েছে',

//Fg Container Data Service
46086: "কন্টেইনার কোড ইতিমধ্যেই বিদ্যমান।",
46087: "সফলভাবে আপডেট হয়েছে",
46088: "আপডেট করার জন্য কোনো তথ্য পাওয়া যায়নি",
46089: 'কার্টন বারকোড পাওয়া যায়নি বা ইতিমধ্যে স্ক্যান করা হয়েছে। অনুগ্রহ করে যাচাই করুন',
46090: 'বারকোড ইতিমধ্যেই স্ক্যান করা হয়েছে',
46091: 'কন্টেইনার তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',
46092: 'এই কন্টেইনারের সাথে কোনো কার্টন ম্যাপ করা হয়নি',
46093: 'প্যাকিং লিস্টের জন্য কার্টন পুনরুদ্ধার হয়েছে',
46094: 'অনুগ্রহ করে কন্টেইনার নির্বাচন করুন',
46095: 'প্যাকিং লিস্টের জন্য কোনো নিশ্চিত কন্টেইনার নেই',
46096: 'অবস্থান ধারণক্ষমতা ইতিমধ্যে পূর্ণ। আরও কন্টেইনার রাখা যাবে না',
46097: 'অবস্থান কন্টেইনার এবং কার্টনের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',













    
}