export const SpsIntlMessageCodesSinhala = {
    
        //sps → 26001-31000
        //DowntimeService
        26001: "පහවුරු කල කාලය සාර්ථකව සාදන ලදී",
        26002: '',
        26003: "පහවුරු කල කාලය සාර්ථකව යාවත්කාලීන කරන ලදී",
        26004: 'පහවුරු කල කාලය යාවත්කාලීන කිරීමේ දෝෂයකි: ${error.message}',
        //ForecastPlanningService
        26005: 'මූල පුරුද්ද සාර්ථකව සුරකිණි',
        26006: 'මූල පුරුද්දේ තත්වය සාර්ථකව ලබා ගන්නා ලදී',
        26007: 'මූල පුරුද්දේ තත්වය ලබා ගැනීම අසාර්ථකයි',
        //ModuleService
        26008: "දෙන ලද අංශ කේතය සඳහා කිසිදු මොඩියුලයක් හමු නොවීය",
      
        26010: "එකම සංරචකය සමඟ දත්ත ඇත",
        26011: `අංශය "යාවත්කාලීන" : "සාදන ලදී" සාර්ථකයි`,
        26012: "කරුණාකර මොඩියුල හැඳුනුම් අංකය ලබා දෙන්න",
        26013: "මොඩියුල දත්ත හමු නොවීය",
        26014: 'මොඩියුලය සාර්ථකව මකා දැමිනි',
        26015: "කිසිදු දත්තයක් හමු නොවීය",
        26016: 'මොඩියුලය සාර්ථකව අක්‍රීය කරන ලදී',
    
        26017: 'අංශ කේතය සඳහා කිසිදු මොඩියුලයක් හමු නොවීය: ${req.secCode}',
        26018: "මොඩියුල සාර්ථකව ලබා ගන්නා ලදී",
        26019: 'මොඩියුල ලබා ගැනීම අසාර්ථකයි: ${error.message}',
        26020: 'මොඩියුල කේතය අවශ්‍යයි',
        26021: 'ලබා දී ඇති මොඩියුල කේතය සඳහා කිසිදු දත්තයක් නොමැත',
        26022: 'දත්ත සාර්ථකව ලබා ගන්නා ලදී',
      
    
        //SewVersionService
        26024: 'PO සහ නිෂ්පාදනය සඳහා OP අනුවාදය දැනටමත් සුරකි ඇත: ${req.productName}',
        26025: 'ක්‍රියාවලිය අනුපිළිවෙල සාර්ථකව සුරකි ඇත',
        26026: 'අනුපිළිවෙල අනුවාද හැඳුනුම් අංකය ලබා දෙන්න',
        26027: 'ලබා දී ඇති අනුවාද හැඳුනුම් අංකය සඳහා OP අනුවාදය නොපවතී',
        26028: 'ක්‍රියාවලිය අනුපිළිවෙල සාර්ථකව මකා දැමිනි',
        26029: 'Ops අනුවාද ID මඟින් ක්‍රියාවලිය අනුවාද ආදර්ශනය ලබා ගැනීමට නොහැක',
        26030: 'ක්‍රියාවලිය අනුවාදය සාර්ථකව පිටපත් කරන ලදී',
        26031: 'අනුවාද විස්තර සාර්ථකව ලබා ගන්නා ලදී',
        26032: 'දත්ත සාර්ථකව ලබා ගන්නා ලදී',
    
        //SewVersionInfoService
        26034: 'ලබා දී ඇති විස්තර සඳහා ක්‍රියාවලිය අනුවාද විස්තර හමු නොවීය',
        26035: 'ක්‍රියාවලිය අනුපිළිවෙලේ රැකියා කණ්ඩායම් විස්තර නොමැත: ${jobGroup}',
    
        //SewingJobGenerationServiceForMO
        26036: 'sewingOrderInfoObj',
    
        26037: 'මැසීම් රැකියා ප්‍රමාණය තීන්දු එකමුතුවේ ප්‍රමාණයට වඩා වැඩිය යුතුය',
        26038: 'මැසීම් රැකියා පෙරදසුන සමූහය සහ විශේෂාංග සඳහා සාර්ථකව ලබා ගන්නා ලදී',
    
        26039: 'OSL REF හැඳුනුම් අංකය සඳහා FGS හමු නොවීය',
        26040: 'මැසීම් රැකියා සාර්ථකව සුරකි ඇත',
        26041: 'මැසීම් රැකියා හමු නොවීය',
        26042: 'මැසීම් රැකියා දැනටමත් සැලසුම් කර ඇත',
        26043: "මැසීම් රැකියා සාර්ථකව මකා දැමිනි",
    
        26044: 'රැකියාව තවමත් සැලසුම් කර නොමැත, කරුණාකර සැලසුම් කර නැවත උත්සාහ කරන්න',
        26045: 'ක්‍රියාවලිය රැකියා ශීර්ෂ ගුණාංග සාර්ථකව ලබා ගන්නා ලදී',
    
        26046: 'අවශ්‍ය පැනලය විස්තර සාර්ථකව ලබා ගන්නා ලදී',
        26047: 'ඉල්ලීම සාර්ථකව සාදන ලදී',
    
        //InputPlanningDashboardService
        26063: "කිසිදු අංශයක් හමු නොවීය",
        26064: "ආදාන සැලසුම් පුවරුවේ දත්ත සාර්ථකව ලබා ගන්නා ලදී",
        26065: 'ආදාන සැලසුම් පුවරුවේ දත්ත ලබා ගැනීම අසාර්ථකයි. දෝෂය',
        26066: "පහවුරු කල කාල විස්තර සාර්ථකව ලබා ගන්නා ලදී",
        26067: 'ට්‍රිම් විස්තරය සාර්ථකව ලබා ගන්නා ලදී.',
        26068: 'ට්‍රිම් විස්තර ලබා ගැනීම අසාර්ථකයි',
    
        26069: "ක්‍රියාවලිය සාර්ථකව ලබා ගන්නා ලදී",
        26070: 'ක්‍රියාවලිය ලබා ගැනීම අසාර්ථකයි: ${err.message}',
        26071: 'මොඩියුල හැඳුනුම් අංකය සඳහා විස්තර ලබා ගැනීම අසාර්ථකයි: ${req.moduleCode}. දෝෂය: ${err.message}',
    
        //SewingOrderService
        26087: 'මැසීම් ඇණවුම සාර්ථකව සාදන ලදී',
        26088: 'මැසීම් ඇණවුම් දත්ත සාර්ථකව ලබා ගන්නා ලදී',
        26089: 'මැසීම් FG තොරතුරු සාර්ථකව සුරකි ඇත',
        26090: 'ලබා දී ඇති ඇණවුම් අංකය සඳහා කිසිදු උප රේඛා හැඳුනුම් අංකයක් නොමැත',
        26091: 'ඇණවුම සඳහා උප රේඛා හැඳුනුම් අංක',
        26092: 'ක්‍රියාවලිය අනුවාදය දැනටමත් සිතිය ඇත, මැසීම් ඇණවුම මකා දැමිය නොහැක',
        26093: 'මැසීම් අනුක්‍රමය නොපවතී',
        26094: "මැසීම් අනුක්‍රමය සාර්ථකව මකා දැමිනි",
        26095: 'මැසීම් අනුක්‍රමය සඳහා පාරිභෝගික තොරතුරු සාර්ථකව ලබා ගන්නා ලදී',
        
        26145: 'සාර්ථකයි'
    }
    
   