export const SpsIntlMessageCodesBangla={
    
        //sps → 26001-31000
        //DowntimeService
        26001: "ডাউন টাইম সফলভাবে তৈরি হয়েছে",
        26002: '',
        26003: "ডাউন টাইম সফলভাবে আপডেট হয়েছে",
        26004: 'ডাউনটাইম আপডেট করতে ত্রুটি: ${error.message}',
        //ForecastPlanningService
        26005: 'পূর্বাভাসের তথ্য সফলভাবে সংরক্ষণ করা হয়েছে',
        26006: 'পূর্বাভাসের স্থিতি সফলভাবে আনা হয়েছে',
        26007: 'পূর্বাভাসের স্থিতি আনতে ত্রুটি',
        //ModuleService
        26008: "প্রদত্ত বিভাগ কোডের জন্য কোন মডিউল পাওয়া যায়নি",
        26010: "একই উপাদানের সাথে ডাটা বিদ্যমান",
        26011: `বিভাগ "আপডেটেড" : "তৈরি" সফলভাবে সম্পন্ন হয়েছে`,
        26012: "অনুগ্রহ করে মডিউল আইডি প্রদান করুন",
        26013: "মডিউলের তথ্য পাওয়া যায়নি",
        26014: 'মডিউল সফলভাবে মুছে ফেলা হয়েছে',
        26015: "কোন তথ্য পাওয়া যায়নি",
        26016: 'মডিউল সফলভাবে নিষ্ক্রিয় করা হয়েছে',
        26017: 'বিভাগ কোড: ${req.secCode} এর জন্য কোন মডিউল পাওয়া যায়নি',
        26018: "মডিউল সফলভাবে আনা হয়েছে",
        26019: 'মডিউল আনতে ব্যর্থ হয়েছে: ${error.message}',
        26020: 'মডিউল কোড আবশ্যক',
        26021: 'প্রদত্ত মডিউল কোডের জন্য কোন তথ্য পাওয়া যায়নি',
        26022: 'তথ্য সফলভাবে আনা হয়েছে',
        968: 'অভ্যন্তরীণ সার্ভার ত্রুটি',
        
        //SewVersionService
        26024: 'পিও এবং প্রোডাক্ট: ${req.productName} এর জন্য অপ ভার্সন ইতিমধ্যেই সংরক্ষিত',
        26025: 'অপারেশন সিকোয়েন্স সফলভাবে সংরক্ষণ করা হয়েছে',
        26026: 'অপ ভার্সন আইডি প্রদান করুন',
        26027: 'প্রদত্ত ভার্সন আইডির জন্য কোন অপ ভার্সন নেই',
        26028: 'অপারেশন সিকোয়েন্স সফলভাবে মুছে ফেলা হয়েছে',
        26029: 'অপ ভার্সন আইডি দ্বারা অপ ভার্সন মডেল আনতে ব্যর্থ',
        26030: 'অপারেশন ভার্সন সফলভাবে ক্লোন করা হয়েছে',
        26031: 'ভার্সন বিস্তারিত সফলভাবে আনা হয়েছে',
        26032: 'তথ্য সফলভাবে আনা হয়েছে',
        
        //InputPlanningDashboardService
        26063: "কোন বিভাগ পাওয়া যায়নি",
        26064: "ইনপুট পরিকল্পনা ড্যাশবোর্ডের তথ্য সফলভাবে আনা হয়েছে",
        26065: 'ইনপুট পরিকল্পনা ড্যাশবোর্ডের তথ্য আনতে ব্যর্থ হয়েছে। ত্রুটি: ${error.message}',
        26066: "ডাউনটাইম বিস্তারিত সফলভাবে আনা হয়েছে",
        26067: 'ট্রিম বিশদ সফলভাবে আনা হয়েছে',
        26068: 'ট্রিম বিশদ আনতে ব্যর্থ হয়েছে',
        26069: "অপারেশন সফলভাবে আনা হয়েছে",
        26070: 'অপারেশন আনতে ব্যর্থ হয়েছে: ${err.message}',
        26071: 'মডিউল কোডের জন্য মডিউল বিশদ আনতে ব্যর্থ হয়েছে: ${req.moduleCode}, ত্রুটি: ${err.message}',
    
        //SewingJobPlanningService
        26072: 'সেলাই আদেশ সফলভাবে আনা হয়েছে',
        26073: 'আদেশ আনতে ব্যর্থ হয়েছে: ${error.message}',
        26074: 'সেলাই আদেশের লাইন সফলভাবে আনা হয়েছে',
        26075: 'অর্ডার লাইন আনতে ব্যর্থ হয়েছে: ${error.message}',
        26076: 'সেলাই অর্ডার সিরিয়াল সফলভাবে আনা হয়েছে',
        26077: 'সেলাই সিরিয়াল আনতে ব্যর্থ হয়েছে',
        26078: 'অপারেশন তথ্য সফলভাবে আনা হয়েছে',
        26079: 'অপারেশন তথ্য আনতে ব্যর্থ হয়েছে: ${error.message}',
        26080: 'কোন সেলাই কাজের তথ্য পাওয়া যায়নি',
        26081: 'অপারেশন সহ সেলাই কাজের তথ্য সফলভাবে আনা হয়েছে',
        26082: 'সেলাই কাজের তথ্য আনতে ব্যর্থ হয়েছে: ${error.message}',
        26083: 'সেলাই কাজ ${req.jobNo} এর স্থিতি সফলভাবে ইন-প্রোগ্রেসে আপডেট করা হয়েছে',
    
        //SewingOrderService
        26084: 'অর্ডার এন্টিটিতে তথ্য সংরক্ষণ করতে ব্যর্থ হয়েছে',
        26085: 'অর্ডার লাইন এন্টিটিতে তথ্য সংরক্ষণ করতে ব্যর্থ হয়েছে',
        26086: 'অর্ডার লাইন গ্রুপ এন্টিটিতে তথ্য সংরক্ষণ করতে ব্যর্থ হয়েছে',
        26087: 'সেলাই অর্ডার সফলভাবে তৈরি হয়েছে',
        26088: 'সেলাই অর্ডারের তথ্য সফলভাবে আনা হয়েছে',
        26089: 'সেলাই এফজি তথ্য সফলভাবে সংরক্ষিত হয়েছে',
        26090: 'প্রদত্ত অর্ডার নম্বরের জন্য কোন উপ-লাইন আইডি নেই',
        26091: 'অর্ডারের জন্য উপ-লাইন আইডি',
        26092: 'অপারেশন ভার্সন ইতিমধ্যে ম্যাপ করা হয়েছে, সেলাই অর্ডার মুছে ফেলা যাবে না',
        26093: 'সেলাই সিরিয়াল বিদ্যমান নেই',
        26094: "সেলাই সিরিয়াল সফলভাবে মুছে ফেলা হয়েছে",
        26095: 'সেলাই সিরিয়ালের জন্য গ্রাহক তথ্য সফলভাবে আনা হয়েছে',
    
        //SectionService
        26105: "প্রদত্ত কোম্পানি কোড এবং ইউনিট কোডের জন্য কোন বিভাগ পাওয়া যায়নি",
        26106: "বিভাগগুলি সফলভাবে আনা হয়েছে",
        26107: 'কোন বিভাগ পাওয়া যায়নি',
        26108: 'কাজের নম্বর প্রয়োজন',
        26109: 'প্রদত্ত কাজের নম্বরের জন্য কোন তথ্য পাওয়া যায়নি',
    
        //WorkstationService
        26115: 'বিভাগ কোডের জন্য কোন ওয়ার্কস্টেশন পাওয়া যায়নি',
        26116: "ওয়ার্কস্টেশন সফলভাবে আনা হয়েছে",
        26117: 'ওয়ার্কস্টেশন আনতে ব্যর্থ হয়েছে: ${error.message}',
        26118: 'ওয়ার্কস্টেশন সফলভাবে নিষ্ক্রিয় করা হয়েছে',
        
        //TrimsIssuedDashboardService
        26124: 'ট্রিম বিশদ সফলভাবে আনা হয়েছে',
        26125: 'ট্রিম বিশদ আনতে ব্যর্থ হয়েছে: ${err.message}',
        26131: 'সমস্ত ইস্যুকৃত পরিমাণ সফলভাবে আপডেট হয়েছে',
    
        //BullQueueService
        26133: 'ওয়ার্কস্টেশন অপারেশন সফলভাবে সক্রিয় করা হয়েছে',
        26134: 'ওয়ার্কস্টেশন সফলভাবে সক্রিয় করা হয়েছে',
        26135: 'বিভাগ সফলভাবে সক্রিয় করা হয়েছে',
        26136: 'মডিউল সফলভাবে সক্রিয় করা হয়েছে',
        26137: 'অপারেশন ভার্সন বিদ্যমান নেই, অনুগ্রহ করে চেক করুন এবং পুনরায় চেষ্টা করুন',
        26138: 'অপ ভার্সনের তথ্য সফলভাবে আনা হয়েছে',
        26139: "তথ্য আনতে ব্যর্থ হয়েছে",
        26140: 'প্রদত্ত আইডির জন্য সেলাই অর্ডার বিবরণ পাওয়া যায়নি, অনুগ্রহ করে চেক করুন এবং পুনরায় চেষ্টা করুন',
    
        26145: 'সফলতা',
    };
    


