export const WmsIntlMessageCodesSinhala = {
//3. wms -(16000-21000)

// ගබඩා මණ්ඩලය

6001: 'බින් රෝල් තොරතුරු සාර්ථකව ලබාගන්නා ලදි',
6002: 'ශීර්ෂ තොරතුරු සාර්ථකව ලබා ගන්නා ලදි',

//grn මණ්ඩල සේවාව
6003: 'GRN තොරතුරු සාර්ථකව ලැබිණි',

//grn සේවාව

6004: 'පූර්ණයෙන්ම පූරණය කර ඇත. කරුණාකර පරීක්ෂා කරන්න',
6005: 'පැකේජ ලැයිස්තුවේ පූරණය ආරම්භ විය.',
6006: 'පැකේජ ලැයිස්තුවේ පූරණය ආරම්භ විය.',
6007: 'සමහර යාවත්කාලීන කිරීම්, කරුණාකර නැවත تازه කරන්න සහ නැවත උත්සාහ කරන්න',
6008: 'නවතා දැමීමේ හේතුව සහ පූරණයට ගත වූ තත්පර අනිවාර්ය වේ',
6009: 'පැකේජ ලැයිස්තුවේ පූරණය නවතා දැමීය.',
6010: 'පැකේජ ලැයිස්තුවේ පූරණය සම්පූර්ණයි.',
6011: 'පැකේජ ලැයිස්තු පූරණ විස්තර සාර්ථකව ලබා ගන්නා ලදි',
6012: 'දෙන ලද රෝල් හැඳුනුම් අංකය සඳහා GRN විස්තර සුරැකිණි',
6013: 'දෙන ලද පැකේජ ලැයිස්තුව සඳහා GRN විස්තර හමු නොවිය. කරුණාකර පරීක්ෂා කරන්න',
6014: 'ට්‍රක් අංකය : ${truckInfo.vehicleNumber} යාත්‍රාවේ පූරණය තවමත් අවසන් වී නොමැත',
6015: 'GRN සාර්ථකව අනුමත කරන ලදි.',
6016: 'වාහන විස්තර හමු නොවිය. කරුණාකර පරීක්ෂා කරන්න.',
6017: 'පරීක්ෂණ අභිප්‍රේත සුරැකිණි',
6018: 'පූරණය අවසන් වී නොමැති බැවින් ඔබට වාහනය පිටතට යැවිය නොහැක',
6019: 'වාහනය සාර්ථකව පිටත් කරන ලදි',
6020: 'දෙන ලද පැකේජ ලැයිස්තු හැඳුනුම් අංකය සඳහා ආරක්ෂක පරීක්ෂා තොරතුරු ලබා ගන්නා ලදි.',
6021: 'ප්‍රමේදවී ඇති වාහන තොරතුරු සාර්ථකව ලබා ගන්නා ලදි',
6022: 'පූරණය අවසන් වී නමුත් ආරක්ෂක පිටත් කිරීමේ වාහන දත්ත නොමැත',
6023: 'වාහන විස්තර හමු නොවිය. කරුණාකර පරීක්ෂා කරන්න.',

// පරීක්ෂා තහවුරු කිරීමේ සේවාව
6024: 'ද්‍රව්‍ය ලැබීමේ තත්වය යාවත්කාලීන කරන ලදි',
6025: 'පරීක්ෂාව ආරම්භ කිරීමට තහවුරු කරන ලදි',

// InspectionInfoService
6026: 'පරීක්ෂණ ඉල්ලීම හමු නොවීය',
6027: 'පරීක්ෂණ ඉල්ලීම් තොරතුරු සාර්ථකව ලබා ගන්නා ලදි',
6028: 'පරීක්ෂණ ඉල්ලීම හමු නොවීය',
6029: 'පරීක්ෂණ ඉල්ලීම් තොරතුරු සාර්ථකව ලබා ගන්නා ලදි',
6030: 'පරීක්ෂණ ඉල්ලීම වලංගු නොවේ',
6031: 'පරීක්ෂණ ඉල්ලීමේ තත්වය සාර්ථකව වෙනස් කරන ලදි',
6032: 'දෙන ලද ලොට් අංකය සහ පරීක්ෂණ කාණ්ඩය සඳහා පරීක්ෂණ ඉල්ලීම හමු නොවීය.',
6033: 'නැවත ඉල්ලීම සඳහා රෝල් හමු නොවීය.',
6034: "දත්ත සාර්ථකව ලබා ගන්නා ලදි",
6035: "දත්ත ලබා ගැනීමේදී දෝෂයක් ඇතිවිය",

//InspectionRollsInfoService
6036: 'පරීක්ෂණ ඉල්ලීම හමු නොවීය',
6037: 'පරීක්ෂණ ඉල්ලීම් තොරතුරු සාර්ථකව ලබා ගන්නා ලදි',

// InspectionService
6038: 'පැකේජ ලැයිස්තු ශීර්ෂය හමු නොවිය. කරුණාකර පරීක්ෂා කරන්න.',
6039: 'පැකේජ ලැයිස්තුව සහිත වාහනය තවමත් ඒකකයට පැමිණ නැත',
6040: 'පරීක්ෂාව සාර්ථකව තහවුරු කරන ලදි.',
6041: 'දෙන ලද පරීක්ෂණ ශීර්ෂ හැඳුනුම් අංකය සඳහා පරීක්ෂණ විස්තර හමු නොවීය',
6042: 'පරීක්ෂාව තවමත් ආරම්භ කර නොමැත, කරුණාකර පරිශීලක මණ්ඩලයේ පරීක්ෂාව ආරම්භ කරන්න.',
6043: 'දෙන ලද පැකේජ ලැයිස්තුව සඳහා GRN විස්තර හමු නොවිය. කරුණාකර පරීක්ෂා කරන්න',
6044: 'දෙන ලද පරීක්ෂණ ශීර්ෂ හැඳුනුම් අංකය සඳහා පරීක්ෂණ රෝල් හමු නොවීය',
6045: 'පරීක්ෂණ ශීර්ෂය සහ රෝල් තොරතුරු සාර්ථකව ලබා ගන්නා ලදි',
6046: 'දෙන ලද පැකේජ ලැයිස්තුව සඳහා GRN විස්තර හමු නොවිය. කරුණාකර පරීක්ෂා කරන්න',
6047: 'දෙන ලද පරීක්ෂණ ශීර්ෂ හැඳුනුම් අංකය සඳහා පරීක්ෂණ රෝල් හමු නොවීය',
6048: 'පරීක්ෂණ ශීර්ෂය සහ රෝල් තොරතුරු සාර්ථකව ලබා ගන්නා ලදි',
6049: 'තීරු කේතය හමු නොවීය.',
6050: 'සැම්පල් තීරු කේතය හමු නොවීය.',

// පදනම් තොරතුරු 
6123: 'රෝල් ප්‍රමාණය නිකුත් කරන ලදි'







}