export const WmsIntlMessageCodesBengali = {
    //3. wms -(16000-21000)

    // warehouse-dashboard

    6001: 'বিন রোল তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6002: 'হেডার তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

    //grn dashboard service
    6003: 'GRN তথ্য সফলভাবে প্রাপ্ত হয়েছে',

    //grn service

    6004: 'আনলোডিং ইতিমধ্যেই সম্পন্ন হয়েছে। অনুগ্রহ করে যাচাই করুন',
    6005: 'আনলোডিং প্যাকিং তালিকা শুরু হয়েছে।',
    6006: 'আনলোডিং প্যাকিং তালিকা শুরু হয়েছে।',
    6007: 'কিছু আপডেট হয়েছে, অনুগ্রহ করে রিফ্রেশ করুন এবং পুনরায় চেষ্টা করুন',
    6008: 'আনলোডিং বিরতি দেওয়ার জন্য বিরতির কারণ এবং আনলোডিং ব্যয় করা সেকেন্ড বাধ্যতামূলক।',
    6009: 'আনলোডিং প্যাকিং তালিকা বিরতি দেওয়া হয়েছে।',
    6010: 'আনলোডিং সম্পন্ন হয়েছে প্যাকিং তালিকার জন্য।',
    6011: 'প্যাকিং তালিকার আনলোডিং বিবরণ সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6012: 'প্রদত্ত রোল আইডির জন্য GRN বিবরণ সফলভাবে সংরক্ষিত হয়েছে',
    6013: 'প্রদত্ত প্যাক তালিকার জন্য GRN বিবরণ পাওয়া যায়নি। অনুগ্রহ করে যাচাই করুন',
    6014: 'ট্রাক নম্বর: ${truckInfo.vehicleNumber} আনলোডিং এখনও সম্পন্ন হয়নি',
    6015: 'GRN সফলভাবে অনুমোদিত হয়েছে।',
    6016: 'যানবাহনের বিবরণ পাওয়া যায়নি। অনুগ্রহ করে পরীক্ষা করুন।',
    6017: 'পরিদর্শন পছন্দ সংরক্ষণ করা হয়েছে',
    6018: 'আনলোডিং সম্পন্ন হয়নি, আপনি গাড়িটি পাঠাতে পারবেন না',
    6019: 'যানবাহন সফলভাবে প্রেরণ করা হয়েছে',
    6020: 'প্রদত্ত প্যাকিং তালিকা আইডির জন্য নিরাপত্তা চেক-ইন তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে।',
    6021: 'উদ্ভিদে থাকা যানবাহনের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6022: 'আনলোডিং সম্পন্ন হয়েছে কিন্তু নিরাপত্তা চেক-আউট যানবাহনের তথ্য নেই',
    6023: 'যানবাহনের বিবরণ পাওয়া যায়নি। অনুগ্রহ করে পরীক্ষা করুন।',

    // inspection conformation service
    6024: 'উপকরণ গ্রহণের অবস্থা আপডেট করা হয়েছে',
    6025: 'পরিদর্শন শুরু করার জন্য নিশ্চিত করা হয়েছে',

    // InspectionInfoService
    6026: 'পরিদর্শন অনুরোধ পাওয়া যায়নি',
    6027: 'পরিদর্শন অনুরোধের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6028: 'পরিদর্শন অনুরোধ পাওয়া যায়নি',
    6029: 'পরিদর্শন অনুরোধের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6030: 'পরিদর্শন অনুরোধ অবৈধ',
    6031: 'পরিদর্শন অনুরোধের অবস্থা সফলভাবে পরিবর্তিত হয়েছে',
    6032: 'প্রদত্ত লট নম্বর এবং পরিদর্শন বিভাগের জন্য পরিদর্শন অনুরোধ পাওয়া যায়নি।',
    6033: 'পুনরায় অনুরোধের জন্য রোল পাওয়া যায়নি।',
    6034: 'তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6035: 'তথ্য আনতে সমস্যা হয়েছে',

    // InspectionRollsInfoService
    6036: 'পরিদর্শন অনুরোধ পাওয়া যায়নি',
    6037: 'পরিদর্শন অনুরোধের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

    // InspectionService
    6038: 'প্যাকিং তালিকা শিরোনাম পাওয়া যায়নি। অনুগ্রহ করে পরীক্ষা করুন।',
    6039: 'প্যাকিং তালিকাযুক্ত যানবাহন এখনও ইউনিটে পৌঁছায়নি',
    6040: 'পরিদর্শন সফলভাবে নিশ্চিত করা হয়েছে।',
    6041: 'প্রদত্ত পরিদর্শন শিরোনাম আইডির জন্য পরিদর্শনের বিবরণ পাওয়া যায়নি',
    6042: 'পরিদর্শন এখনও শুরু হয়নি, অনুগ্রহ করে বোর্ডে পরিদর্শন শুরু করুন।',
    6043: 'প্রদত্ত প্যাক তালিকার জন্য GRN বিবরণ পাওয়া যায়নি। অনুগ্রহ করে যাচাই করুন',
    6044: 'প্রদত্ত পরিদর্শন শিরোনাম আইডির জন্য পরিদর্শন রোল পাওয়া যায়নি',
    6045: 'পরিদর্শন শিরোনাম এবং রোল তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6046: 'প্রদত্ত প্যাক তালিকার জন্য GRN বিবরণ পাওয়া যায়নি। অনুগ্রহ করে যাচাই করুন',
    6047: 'প্রদত্ত পরিদর্শন শিরোনাম আইডির জন্য পরিদর্শন রোল পাওয়া যায়নি',
    6048: 'পরিদর্শন শিরোনাম এবং রোল তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6049: 'বারকোড পাওয়া যায়নি।',
    6050: 'নমুনা বারকোড পাওয়া যায়নি।',
    6051: 'প্রদত্ত রোল আইডি এবং পরিদর্শন বিভাগের জন্য পরিদর্শন আইডি পাওয়া যায়নি',
    6052: 'অনুগ্রহ করে পরিদর্শন অনুরোধ আইডি প্রদান করুন',
    6053: 'প্রদত্ত অনুরোধ আইডির জন্য পরিদর্শন অনুরোধের বিবরণ পাওয়া যায়নি, অনুগ্রহ করে যাচাই করুন',
    6054: 'পরিদর্শন শিরোনাম ইতিমধ্যে পরিদর্শিত হয়েছে। অনুগ্রহ করে যাচাই করুন।',
    6055: 'পরিদর্শনের ফলাফল সফলভাবে আপডেট করা হয়েছে',
    6056: 'অনুগ্রহ করে পরিদর্শন অনুরোধ আইডি প্রদান করুন',

    // LocationAllocationService
    6079: 'রোল আইডি প্রদান করা হয়নি',
    6080: 'রোল অবস্থানের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

    // PalletBinMappingService
    6082: 'অনুগ্রহ করে প্যালেট নির্বাচন করুন',
    6083: 'প্রস্তাবিত বিন থেকে আলাদা বিনে বরাদ্দের চেষ্টা করা হচ্ছে',
    6084: 'প্যালেট ইতিমধ্যেই বর্তমান বিনে স্থাপন করা হয়েছে',
    6085: 'অনুমোদন ছাড়া কেবল প্রস্তাবিত বিনে প্যালেট রাখা যেতে পারে',
    6086: 'প্যালেট বিনে ম্যাপ করা হয়েছে',
    6087: 'অনুগ্রহ করে প্যালেট নির্বাচন করুন',
    6088: 'প্যালেট ইতিমধ্যেই একটি বিনে নিশ্চিত করা হয়েছে',
    6089: 'প্যালেট ইতিমধ্যেই একই বিনে ম্যাপ করা হয়েছে',
    6090: 'প্যালেট প্রস্তাবিত বিনে ম্যাপ করা হয়েছে',
    6091: 'প্যাকিং তালিকার জন্য কোনো নিশ্চিত প্যালেট নেই',
    6092: 'প্যালেট বিনে ম্যাপ করা হয়েছে',
    6093: 'বিন বিদ্যমান নেই',
    6094: 'বিনের ধারণক্ষমতা পূর্ণ হয়ে গেছে। আরও প্যালেট রাখা সম্ভব নয়',
    6095: 'বিন বিদ্যমান নেই',
    6096: 'বিনের ধারণক্ষমতা পূর্ণ হয়ে গেছে। আরও প্যালেট রাখা সম্ভব নয়',
    6097: 'প্যাকিং তালিকার জন্য কোনো নিশ্চিত প্যালেট নেই',
    6098: 'প্যালেট সফলভাবে আনম্যাপ করা হয়েছে।',

    // MaterialIssuanceService
    6099: 'রোল পরিমাণ ইস্যু করা হয়েছে',

    // PalletGroupCreationService
    6100: 'প্যাক তালিকার জন্য প্যালেট গ্রুপ ইতিমধ্যেই তৈরি করা হয়েছে',
    6101: 'প্যালেট গ্রুপ সফলভাবে তৈরি করা হয়েছে',

    // PalletGroupInfoService
    6102: 'প্যাক তালিকার জন্য প্যালেট গ্রুপ সফলভাবে পুনরুদ্ধার করা হয়েছে',
    6103: 'রোল কোনো প্যালেট গ্রুপের সাথে ম্যাপ করা হয়নি',
    6104: 'কোনো প্যালেট গ্রুপ পাওয়া যায়নি: ',

    // PalletInfoService
    6105: 'প্যালেট বিদ্যমান নেই',
    6123: 'রোল পরিমাণ ইস্যু করা হয়েছে',

    6124: "বিন কোড ইতিমধ্যেই উপলব্ধ, দয়া করে চেক করুন",
    6125: "দয়া করে বিন আইডি প্রদান করুন",
    6126: "বিন বিদ্যমান নেই",
    6127: "${palletsInBin.length} প্যালেট বিনে উপস্থিত রয়েছে। নিষ্ক্রিয় করা যাবে না",
    6128: "${trolleysInBin.length} ট্রলি বিনে উপস্থিত রয়েছে। নিষ্ক্রিয় করা যাবে না",

    6131: "বিনের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6132: "র‌্যাক বিদ্যমান নেই",
    6133: "র‌্যাক এবং বিন তথ্য পুনরুদ্ধার করা হয়েছে",

    6134: "মুভার্স কোড ইতিমধ্যেই উপলব্ধ, দয়া করে চেক করুন",
    6135: "মুভার্স ${reqModel.id ? 'আপডেট' : 'তৈরি'} সফলভাবে সম্পন্ন হয়েছে",

    6137: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",

    6138: "প্যালেট কোড ইতিমধ্যেই উপলব্ধ, দয়া করে চেক করুন",
    6139: "প্যালেট ${reqModel.id ? 'আপডেট' : 'তৈরি'} সফলভাবে সম্পন্ন হয়েছে",

    6141: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6142: "কোনো প্যালেট তথ্য পাওয়া যায়নি",

    6143: "র‌্যাক কোড ইতিমধ্যেই উপলব্ধ, দয়া করে চেক করুন",
    6144: "র‌্যাক ${reqModel.id ? 'আপডেট' : 'তৈরি'} সফলভাবে সম্পন্ন হয়েছে",

    6146: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6147: "র‌্যাকের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",

    6148: "কারণের কোড ইতিমধ্যেই উপলব্ধ, দয়া করে চেক করুন",
    6149: "কারণ ${reqModel.id ? 'আপডেট' : 'তৈরি'} সফলভাবে সম্পন্ন হয়েছে",
    6150: "কারণ সরবরাহ করা হয়নি",

    6151: "কেউ ইতিমধ্যে এই রেকর্ডটি পরিবর্তন করেছেন, দয়া করে রিফ্রেশ করুন এবং চালিয়ে যান",
    6152: "রোল অ্যাট্রিবিউট ${reqModel.id ? 'আপডেট' : 'তৈরি'} সফলভাবে সম্পন্ন হয়েছে",

    6155: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",

    6157: "ট্রে কোড ${reqModel.code} ইতিমধ্যেই উপলব্ধ, দয়া করে চেক করুন",
    6158: "ট্রে সফলভাবে তৈরি হয়েছে",
    6160: "ট্রে আইডি বিদ্যমান নেই",
    6161: "ট্রে সফলভাবে আপডেট হয়েছে",
    6162: "ট্রে বিদ্যমান নেই",
    6163: "ট্রেগুলি বিদ্যমান নেই",
    6164: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6165: "প্রদত্ত বারকোডগুলির জন্য ট্রে পাওয়া যায়নি",
    6166: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6167: "প্রদত্ত ট্রে কোডগুলির জন্য ট্রে পাওয়া যায়নি",
    6168: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6169: "ট্রে আইডি সরবরাহ করা হয়নি",
    6170: "ট্রে আইডি সরবরাহ করা হয়নি",
    6171: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6172: "প্রদত্ত আইডির জন্য কোনো ট্রে বিদ্যমান নেই",

    6173: "ট্রলি কোড ইতিমধ্যেই উপলব্ধ, দয়া করে চেক করুন",
    6174: "ট্রলি সফলভাবে তৈরি হয়েছে",
    6175: "ট্রলি আইডি সরবরাহ করা হয়নি",
    6176: "ট্রলি আইডি বিদ্যমান নেই",
    6177: "ট্রলি সফলভাবে আপডেট হয়েছে",
    6178: "দয়া করে ট্রলি আইডি প্রদান করুন",
    6179: "ট্রলি বিদ্যমান নেই",
    6180: "${traysInTrolley.length} ট্রে ট্রলিতে উপস্থিত রয়েছে। নিষ্ক্রিয় করা যাবে না",
    6181: "ট্রলি পাওয়া যায়নি",
    6182: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6183: "ট্রলি বারকোড সরবরাহ করা হয়নি",
    6184: "ট্রলি বারকোড সরবরাহ করা হয়নি",
    6185: "প্রদত্ত বারকোডগুলির জন্য কোনো ট্রলি পাওয়া যায়নি",
    6186: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6187: "ট্রলি আইডি সরবরাহ করা হয়নি",
    6188: "ট্রলি আইডি সরবরাহ করা হয়নি",
    6189: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6190: "প্রদত্ত আইডির জন্য কোনো ট্রলি বিদ্যমান নেই",

    6191: "কেউ ইতিমধ্যে এই রেকর্ডটি পরিবর্তন করেছেন, দয়া করে রিফ্রেশ করুন এবং চালিয়ে যান",
    6192: "ইউজার গ্রুপ ${reqModel.id ? 'আপডেট' : 'তৈরি'} সফলভাবে সম্পন্ন হয়েছে",

    6194: "তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে",

    6195: "কাট টেবিলের জন্য কোনো মুলতুবি অনুরোধ পাওয়া যায়নি",
    6196: "কাট টেবিলের জন্য মুলতুবি গুদাম অনুরোধ সফলভাবে পুনরুদ্ধার করা হয়েছে",
    6197: "কাট টেবিলের জন্য মুলতুবি গুদাম অনুরোধ সফলভাবে পুনরুদ্ধার করা হয়েছে",
//FabricRequestCreationService

6198: 'গুদাম অনুরোধ তৈরি হয়েছে',
6199: 'অনুরোধের আইডি: ${req.id} এবং অনুরোধ নম্বর: ${req.requestNo} অনুপস্থিত',
6200: 'এই আইডি: ${req.id} এবং অনুরোধ নম্বর: ${req.requestNo} এর জন্য ইতিমধ্যে অনুরোধ তৈরি হয়েছে',
6201: 'প্রদত্ত আইটেম সংখ্যা: ${itemIds.length}. বিদ্যমান মজুদের সংখ্যা: ${rollsInfo.length}',
6202: 'প্রদত্ত আইডি এবং বারকোড মিলছে না। আইডি: ${i.inventoryId} এবং বারকোড: ${i.barcode}',
6203: 'গুদাম অনুরোধ তৈরি হয়েছে',
6204: 'বহিরাগত অনুরোধ নম্বর প্রদান করা হয়নি',
6205: 'এই অনুরোধ নম্বর: ${req.extReqNo} এর জন্য কোন অনুরোধ নেই',
6206: 'গুদাম অনুরোধ মুছে ফেলা হয়েছে',

//FabricRequestHandlingService
6207: 'প্রদত্ত অনুরোধ নম্বর: ${req.materialRequestNo} বিদ্যমান নয়',
6208: 'প্রদত্ত অনুরোধ নম্বর: ${req.materialRequestNo} কোনো ডকেটে সংযুক্ত নয়',
6209: 'এই অনুরোধের জন্য ইতিমধ্যে উপাদান সরবরাহ করা হয়েছে',
6210: 'উপাদান কাটার টেবিলে সরবরাহ করা হয়েছে',
6211: 'প্রদত্ত অনুরোধ নম্বর: ${req.materialRequestNo} বিদ্যমান নয়',
6212: 'প্রদত্ত অনুরোধ নম্বর: ${req.materialRequestNo} কোনো ডকেটে সংযুক্ত নয়',
6213: 'এই অনুরোধের জন্য উপাদান প্রস্তুতির জন্য ইতিমধ্যে নির্ধারিত হয়েছে',
6214: 'উপাদান কাটার টেবিলে সরবরাহ করা হয়েছে',
6215: 'ডকেট গ্রুপের জন্য ইতিমধ্যে একটি লেইং অপারেশন চলছে',

//PackingListService
6216: 'প্যাকিং তালিকায় ডুপ্লিকেট লট নম্বর চিহ্নিত হয়েছে, অনুগ্রহ করে পরীক্ষা করুন।',
6217: 'লট নম্বরের মধ্যে ডুপ্লিকেট রোল নম্বর চিহ্নিত হয়েছে, অনুগ্রহ করে পরীক্ষা করুন।',
6218: 'প্রদত্ত প্যাকিং তালিকা কোড সহ প্যাকিং তালিকা ইতিমধ্যে বিদ্যমান।',
6219: 'প্যাকিং তালিকা সফলভাবে তৈরি হয়েছে।',
6220: 'প্যাকিং তালিকা সফলভাবে মুছে ফেলা হয়েছে।',
6221: 'প্যাকিং তালিকার জন্য প্রক্রিয়াকরণ শুরু হয়েছে, আপনি সম্পাদনা বা মুছে ফেলতে পারবেন না।',
6222: 'প্যাকিং তালিকা সফলভাবে মুছে ফেলা হয়েছে।',
6223: 'প্রদত্ত মানদণ্ডের জন্য কোন প্যাকিং তালিকা পাওয়া যায়নি।',
6224: 'ডেটা পুনরুদ্ধারে ত্রুটি: ${error.message}',
6225: 'অপেক্ষমাণ সরবরাহকারী PO তথ্য সফলভাবে গ্রহণ করা হয়েছে।',
6226: 'সরবরাহকারী PO সংক্ষিপ্তসার সফলভাবে গ্রহণ করা হয়েছে।',
6227: 'প্রদত্ত মানদণ্ডের জন্য কোন প্যাকিং তালিকা পাওয়া যায়নি।',
6228: 'প্যাকিং তালিকা সফলভাবে নিশ্চিত হয়েছে।',
6229: 'প্রদত্ত মানদণ্ডের জন্য কোন প্যাকিং তালিকা পাওয়া যায়নি।',
6230: 'প্যাকিং তালিকা সংক্ষিপ্তসার সফলভাবে পুনরুদ্ধার হয়েছে।',

//StockConsumptionService
6245: 'আইটেম: ${item.itemBarcode} (আইডি: ${item.itemId}) বিদ্যমান নয়',
6246: 'স্টক খরচ সফলভাবে আপডেট হয়েছে',
6247: 'রোল: ${req.rollId} বিদ্যমান নয়',
6248: 'স্টক খরচ সফলভাবে আপডেট হয়েছে',
6249: 'রোল: ${req.rollId} বিদ্যমান নয়',
6250: 'স্টক খরচ সফলভাবে আপডেট হয়েছে',

//StockInfoService
6251: 'স্টক পুনরুদ্ধারের জন্য আইটেম কোড প্রদান করা হয়নি',
6252: 'স্টক পুনরুদ্ধারের জন্য বিক্রয় আদেশ কোড প্রদান করা হয়নি',
6253: 'প্রদত্ত বিক্রয় আদেশের জন্য কোন PO পাওয়া যায়নি',
6254: 'স্টক পাওয়া যায়নি।',
6255: 'স্টক ডেটা সফলভাবে পুনরুদ্ধার হয়েছে।',

//PackingListDashboardService
6256: 'সরবরাহকারী ভিত্তিক তথ্য পুনরুদ্ধার হয়েছে',
6257: 'ডেটা সফলভাবে পুনরুদ্ধার হয়েছে',
6258: 'সফল',

//PreIntegrationService
6259: 'সরবরাহকারী PO পাওয়া যায়নি, অনুগ্রহ করে পরীক্ষা করুন',
6260: 'সরবরাহকারী PO পাওয়া যায়নি, অনুগ্রহ করে পরীক্ষা করুন',
6261: 'সরবরাহকারী PO আইটেম তথ্য সফলভাবে পুনরুদ্ধার হয়েছে।',
6262: 'সরবরাহকারী তথ্য সফলভাবে পুনরুদ্ধার হয়েছে।',
6263: 'স্টাইল ভিত্তিক স্টক সংক্ষিপ্তসার সফলভাবে পুনরুদ্ধার হয়েছে।',
6264: 'প্যাকিং তালিকার আনলোডিং শুরু হয়েছে।',
6265: 'বিক্রয় আদেশের তথ্য পাওয়া যায়নি।',
6266: 'বিক্রয় আদেশের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে।',

//TrayRollInfoService
6276: 'রোল আইডি প্রদান করা হয়নি',
6277: 'প্রদত্ত রোলগুলির জন্য ট্রে এখনও ম্যাপ করা হয়নি',
6278: 'ট্রে রোলগুলি সফলভাবে পুনরুদ্ধার হয়েছে',

//TrayRollMappingService
6282: 'রোল আইডি প্রদান করা হয়নি',
6283: 'প্রদত্ত রোল বিদ্যমান নয়',
6284: 'রোল এখনও কোনও ট্রেতে ম্যাপ করা হয়নি',
6285: 'রোল ট্রলি থেকে আনম্যাপ করা হয়েছে',
6286: 'অনুগ্রহ করে ট্রে আইডি প্রদান করুন',
6290: 'ট্রে ধারণক্ষমতা ${trayCapacity} রোলের জন্য ইতিমধ্যে পূর্ণ',

//TrolleyBinMappingService
6314: 'প্রদত্ত আইডির জন্য কোন ট্রলি পাওয়া যায়নি',
6315: 'ট্রলি এখনও কোনও বিনে ম্যাপ করা হয়নি',
6316: 'ট্রলি সফলভাবে বিন থেকে আনম্যাপ করা হয়েছে',
6321: 'ট্রলি কেবলমাত্র LEVEL-1 বিনে রাখা যেতে পারে',
6323: 'বিন ধারণক্ষমতা ইতিমধ্যে পূর্ণ, ${trolleyBinCount} ট্রলি বিদ্যমান',
6325: 'ট্রলি সফলভাবে বিনে ম্যাপ করা হয়েছে',

//FabricRequestHandlingHelperService
6326: 'কাটিং টিম থেকে ডকেট স্থিতি পরীক্ষা করতে অক্ষম',
6327: 'প্রদত্ত আইডির জন্য প্যাকিং তালিকার যানবাহন সংক্রান্ত তথ্য পাওয়া যায়নি',

//PalletGroupInfoService
6334: 'প্যাকিং তালিকার জন্য কোন প্যালেট গ্রুপ ম্যাপ করা হয়নি',
6335: 'প্যালেট গ্রুপের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',

//PalletInfoService
6336: 'প্যালেট তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',
6337: 'প্যাকিং তালিকার জন্য রোলগুলি পুনরুদ্ধার হয়েছে',

//ReasonsDataService
6342: 'ট্রে আইডি প্রদান করা হয়নি',
6343: 'ট্রে বারকোড প্রদান করা হয়নি',

   








}