export const PtsIntlMessageCodesSinhala = {
 // pts → 31001-36000

  //emb-tracking
  16021: 'ඉල්ලීමේදී කිසිදු ගබඩා ලිපි නොමැත',


  16022: 'Emb රේඛා තෝරාගෙන නොමැත',
  16023: 'Emb රේඛා හමු නොවීය',
  16024: 'දොකට්ටුව සඳහා ව්‍යාපාරික ඉල්ලීම දැනටමත් සාදන ලදි: ${embLine.embParentJobRef}',
  16025: 'එක් ව්‍යාපාරික ඉල්ලීමක් යටතේ බහු විකුණුම්කරුවන් නොමැත',
  16026: 'ව්‍යාපාරික ඉල්ලීමකට එක් කට්ටලයක් පමණක් තිබිය හැක',
  16027: "Emb ව්‍යාපාරික ඉල්ලීම සාර්ථකව සාදන ලදි",

  16028: 'තත්ත්වය දැනටමත් ${embDrEnt.requestStatus}. ඉල්ලීම මකා දැමිය නොහැක',
  16029: 'Emb ව්‍යාපාරික ඉල්ලීම සාර්ථකව මකා දැමන ලදි',

  16030: 'වත්මන් තත්ත්වය දැනටමත් ${embDispatchStatusEnumDisplayValues[embDrEnt.requestStatus]}',
  16031: 'වත්මන් තත්ත්වය ${embDispatchStatusEnumDisplayValues[embDrEnt.requestStatus]}. පෙර තත්ත්ව යාවත්කාලීන කිරීම සදහා ඉඩ නැත',
  16032: 'Emb ව්‍යාපාරික තත්ත්වය සාර්ථකව වෙනස් කරන ලදි',

  16033: 'මුද්‍රණ තත්ත්වය සාර්ථකව යාවත්කාලීන කරන ලදි',

  //EmbDispatchInfoService

  16034: 'ව්‍යාපාරික ඉල්ලීමේ හැඳුනුම් අංකය ලබා දී නොමැත',
  //EmbRejectionService
  16035: 'ප්‍රතික්ෂේපයන් හමු නොවීය: ${barcode} ',

  //EmbRequestInfoService

  16036: 'Emb කාර්යය ${req.embJobNumber} හමු නොවීය',


  16037: 'කරුණාකර Emb රේඛා ලබාදෙන්න',
  16038: 'Emb රේඛා නොපවතී',
  //EmbRequestService
  16039: 'ලබාදිය ඇති ගබඩා ලිපි Emb මෙහෙයුමට අදාළ සංරචක නොමැත',
  16040: 'EMB කාර්යය සාදන ලදි',
  16041: 'Emb රේඛාව සාර්ථකව මකාදැමන ලදි',
  16042: 'දොකට්ටුව ${req.docketNumber} සඳහා EMB ශීර්ෂය පද්ධතියේ නොපවතී',
  16043: 'EMB ශීර්ෂය සහ ලිපිය සඳහා Emb රේඛා පවතී: ${req.docketNumber}',
  16044: 'දොකට්ටුව ${req.docketNumber} සඳහා EMB ශීර්ෂ විස්තර මකාදැමන ලදි',

  16045: 'කාර්යය සඳහා බන්ඩල් ටැගය දැනටමත් මුද්‍රණය කර ඇත: ${req.embJobNumber} සහ ආලේපන හැඳුනුම් අංකය: ${line.embActualJobRef}',
  16046: 'Emb තීරු කේතය සාර්ථකව මුද්‍රණය කරන ලදි',
  16047: 'කාර්යය සඳහා බන්ඩල් ටැගය දැනටමත් නිකුත් කර ඇත: ${req.embJobNumber} සහ ආලේපන හැඳුනුම් අංකය: ${line.embActualJobRef}',
  16048: 'Emb තීරු කේත නිකුතුව සාර්ථකයි',
  16049: 'ඉල්ලීමේදී කිසිදු ගබඩා ලිපි ලබා දී නොමැත',
  16050: 'Emb රේඛා සාර්ථකව ස්ථිර කරන ලදි',

  //EmbTrackingInfoService
  16051: 'දොකට්ටුව සඳහා කිසිදු Emb කාර්යයක් හමු නොවීය: ${req.docketNumber} සහ මෙහෙයුම: ${req.operationCode}',
  16052: 'Emb බන්ඩල් ලබාගන්නා ලදි',
  16053: 'කාර්යය ස්කෑන් කරන ලද ප්‍රමාණ ලබාගන්නා ලදි',
  //EmbTrackingService
  16054: 'Emb කාර්යය: ${req.embJobNumber} දැනටමත් සාදන ලදි',
  16055: 'ලබාදී ඇති ආලේපන හැඳුනුම් අංක සඳහා Emb මෙහෙයුම් සංරචක නොමැත',
  16056: 'Emb කාර්යය සාර්ථකව සාදන ලදි',
  16057: 'ලබාදී ඇති ප්‍රතික්ෂේප ප්‍රමාණය සහ හේතු අනූව ප්‍රමාණ නොගැලපේ',
  16058: 'මෙහෙයුම බන්ඩලයට අයත් නොවේ. කරුණාකර පරීක්ෂා කරන්න',
  16059: 'මෙහෙයුම සඳහා ${scannedQty.g_qty} ක් පමණක් සම්පූර්ණයි. නමුත් ${req.gQty} ආපසු කිරීමට ඔබ උත්සාහ කරයි',
  16060: 'ඊළඟ මෙහෙයුම ${postOpBarcode.postOp} දැනටමත් සම්පූර්ණයි. ආපසු හැරවිය හැකි ප්‍රමාණය: ${availableReversableQty}',

  16061: 'ප්‍රතික්ෂේප කිරීමක් සිදු කර නැති බැවින් ආපසු හැරවිය නොහැක',

  16062: 'Emb කාර්ය අංකය සහ මෙහෙයුම් කේතය ලබා දී නොමැත',
  16063: 'Emb කාර්යය සහ මෙහෙයුම සඳහා කිසිදු ගනුදෙනුවක් නොමැත',
  16064: 'මෙහෙයුම සඳහා තීරු කේතය වලංගු නොවේ',
  16065: 'බන්ඩලය දැනටමත් මෙහෙයුම සඳහා ස්කෑන් කර ඇත',
  16066: 'බන්ඩල ප්‍රමාණය ට වඩා වැඩි ස්කෑන් කිරීම උත්සාහ කරයි. බන්ඩල ප්‍රමාණය: ${barcodeRecord.quantity}. දැනටමත් ස්කෑන් කළ ප්‍රමාණය: ${preScanQty}',
  16067: 'පෙර මෙහෙයුම ${preOpBarcode.preOp} සම්පූර්ණ කර නොමැත. ලබාගත හැකි ප්‍රමාණය: ${availableScannableQty}',
  16068:'${req.embDispatchId} සඳහා කිසිදු ව්‍යාපාරික ඉල්ලීමක් හමු නොවීය',
  16069:'ව්‍යාපාරික ඉල්ලීම් ලබාගන්නා ලදි',
  16070:'PO සඳහා කිසිදු Emb කාර්යයක් හමු නොවීය',
  16071:'Emb ශීර්ෂ තොරතුරු ලබාගන්නා ලදි',
  16072:'පද්ධතියේ ${req.embJobNumber} සඳහා EMB ශීර්ෂය නොමැත',
  16073: '${req.embJobNumber} සඳහා EMB රේඛා නොපවතී',
  16074: 'Emb රේඛා හැඳුනුම් අංක ලබාදෙන්න',
  16075: 'ස්ථිර කිරීමට Emb රේඛා හමු නොවීය',
  16076:'තීරු කේතය ${req.barcode} නොපවතී',
  16077:'තීරු කේතය: ${req.barcode} සඳහා Emb කාර්යය හමු නොවීය',
  16078:'Emb කාර්යයන් ස්ථිර කර ඇත. හැකිනම් කට්ටලය දැනටමත් යවා ඇත',
  16079:'බන්ඩල් ස්කෑන් සාර්ථකයි',

}