export const PtsIntlMessageCodesBangla = {
//emb-tracking
// pts → 31001-36000


    //emb-tracking
    16021: 'অনুরোধে কোনো ডকেট দেওয়া হয়নি',
  
    16022: 'এম্ব লাইনগুলি নির্বাচন করা হয়নি',
    16023: 'এম্ব লাইনগুলি পাওয়া যায়নি',
    16024: 'ডকেট: ${embLine.embParentJobRef} এর জন্য প্রেরণ অনুরোধ ইতিমধ্যে তৈরি করা হয়েছে',
    16025: 'একই প্রেরণ অনুরোধের অধীনে একাধিক বিক্রেতা থাকতে পারে না',
    16026: 'একটি প্রেরণ অনুরোধে শুধুমাত্র ১টি কাট অর্ডার থাকতে পারে',
    16027: "এম্ব প্রেরণ অনুরোধ সফলভাবে তৈরি হয়েছে",
  
    16028: 'স্থিতি ইতিমধ্যে ${embDrEnt.requestStatus}। অনুরোধ মুছে ফেলা যাবে না',
    16029: 'এম্ব প্রেরণ অনুরোধ সফলভাবে মুছে ফেলা হয়েছে',
  
    16030: 'বর্তমান অবস্থা ইতিমধ্যে ${embDispatchStatusEnumDisplayValues[embDrEnt.requestStatus]}',
    16031: 'বর্তমান অবস্থা ${embDispatchStatusEnumDisplayValues[embDrEnt.requestStatus]}। পূর্ববর্তী অবস্থা আপডেট করার অনুমতি নেই',
    16032: 'এম্ব প্রেরণের স্থিতি সফলভাবে পরিবর্তন হয়েছে',
  
    16033: 'প্রিন্ট স্থিতি সফলভাবে আপডেট হয়েছে',
  
    //EmbDispatchInfoService
    16034: 'প্রেরণ অনুরোধ আইডি প্রদান করা হয়নি',
    //EmbRejectionService
    16035: '${barcode} এর জন্য প্রত্যাখ্যান পাওয়া যায়নি',
  
    //EmbRequestInfoService
    16036: 'এম্ব কাজ ${req.embJobNumber} পাওয়া যায়নি',
  
    16037: 'এম্ব লাইন সরবরাহ করুন',
    16038: 'এম্ব লাইন বিদ্যমান নেই',
    //EmbRequestService
    16039: 'প্রদত্ত ডকেটগুলির জন্য এম্ব অপারেশনের জন্য কোনো উপাদান ম্যাপ করা নেই',
    16040: 'এম্ব কাজ তৈরি হয়েছে',
    16041: 'এম্ব লাইন সফলভাবে মুছে ফেলা হয়েছে',
    16042: 'সিস্টেমে ডকেট ${req.docketNumber} এর জন্য এম্ব হেডার বিদ্যমান নেই',
    16043: 'ডকেট ${req.docketNumber} এর জন্য এম্ব হেডার এবং এম্ব লাইন বিদ্যমান',
    16044: 'ডকেট ${req.docketNumber} এর জন্য এম্ব হেডার বিবরণ সফলভাবে মুছে ফেলা হয়েছে',
  
    16045: 'কাজ ${req.embJobNumber} এবং লেয়িং আইডি ${line.embActualJobRef} এর জন্য বান্ডেল ট্যাগ ইতিমধ্যে প্রিন্ট করা হয়েছে',
    16046: 'এম্ব বারকোড প্রিন্ট সফল হয়েছে',
    16047: 'কাজ ${req.embJobNumber} এবং লেয়িং আইডি ${line.embActualJobRef} এর জন্য বান্ডেল ট্যাগ ইতিমধ্যে প্রকাশিত হয়েছে',
    16048: 'এম্ব বারকোড প্রিন্ট রিলিজ সফল হয়েছে',
    16049: 'অনুরোধে কোনো ডকেট দেওয়া হয়নি',
    16050: 'এম্ব লাইন সফলভাবে ফ্রিজ করা হয়েছে',
  
    //EmbTrackingInfoService
    16051: 'ডকেট ${req.docketNumber} এবং অপারেশন ${req.operationCode} এর জন্য কোনো এম্ব কাজ পাওয়া যায়নি',
    16052: 'এম্ব বান্ডেলগুলি পুনরুদ্ধার করা হয়েছে',
    16053: 'কাজ স্ক্যান করা পরিমাণ পুনরুদ্ধার করা হয়েছে',
    //EmbTrackingService
    16054: 'এম্ব কাজ: ${req.embJobNumber} ইতিমধ্যে তৈরি হয়েছে',
    16055: 'প্রদত্ত লেয়িং আইডি এম্ব অপারেশনের জন্য কোনো উপাদান ম্যাপ করা নেই',
    16056: 'এম্ব কাজ সফলভাবে তৈরি হয়েছে',
    16057: 'প্রবেশ করানো প্রত্যাখ্যান পরিমাণ এবং কারণ ভিত্তিক পরিমাণ মিলছে না',
    16058: 'অপারেশন বান্ডেলের অন্তর্ভুক্ত নয়। দয়া করে যাচাই করুন',
    16059: 'শুধুমাত্র ${scannedQty.g_qty} এই অপারেশনের জন্য সম্পন্ন হয়েছে। কিন্তু আপনি ${req.gQty} উল্টে দেওয়ার চেষ্টা করছেন',
    16060: 'পরবর্তী অপারেশন ${postOpBarcode.postOp} ইতিমধ্যে সম্পন্ন হয়েছে। উপলব্ধ উল্টে দেওয়া পরিমাণ: ${availableReversableQty}',
  
    16061: 'উল্টে দেওয়ার জন্য কোনো প্রত্যাখ্যান করা হয়নি',
  
    16062: 'এম্ব কাজ নম্বর এবং অপারেশন কোড অনুরোধে প্রদান করা হয়নি',
    16063: 'এম্ব কাজ এবং অপারেশনের জন্য কোনো লেনদেন বিদ্যমান নেই',
    16064: 'অপারেশনের জন্য বারকোডটি অবৈধ',
    16065: 'বান্ডেল ইতিমধ্যে অপারেশনের জন্য স্ক্যান করা হয়েছে',
    16066: 'বান্ডেল পরিমাণের চেয়ে বেশি স্ক্যান করার চেষ্টা করা হচ্ছে। বান্ডেল পরিমাণ: ${barcodeRecord.quantity}, ইতিমধ্যে স্ক্যান করা পরিমাণ: ${preScanQty}',
    16067: 'পূর্ববর্তী অপারেশন ${preOpBarcode.preOp} সম্পন্ন করা হয়নি। উপলব্ধ পরিমাণ: ${availableScannableQty}',
    16068: '${req.embDispatchId} এর জন্য কোনো প্রেরণ অনুরোধ পাওয়া যায়নি',
    16069: 'প্রেরণ অনুরোধগুলি পুনরুদ্ধার করা হয়েছে',
    16070: 'PO এর জন্য কোনো এম্ব কাজ পাওয়া যায়নি',
    16071: 'এম্ব হেডার তথ্য পুনরুদ্ধার করা হয়েছে',
    16072: 'সিস্টেমে কাজ ${req.embJobNumber} এর জন্য এম্ব হেডার বিদ্যমান নেই',
    16073: 'কাজ ${req.embJobNumber} এর জন্য এম্ব লাইন বিদ্যমান নেই',
    16074: 'এম্ব লাইন আইডি সরবরাহ করুন',
    16075: 'ফ্রিজ করার জন্য কোনো এম্ব লাইন পাওয়া যায়নি',
    16076: 'বারকোড ${req.barcode} বিদ্যমান নেই',
    16077: 'বারকোড ${req.barcode} এর জন্য কোনো এম্ব কাজ পাওয়া যায়নি',
    16078: 'এম্ব কাজগুলি ফ্রিজ করা হয়েছে। সম্ভবত কাট ইতিমধ্যে প্রেরণ করা হয়েছে',
    16079: 'বান্ডেল স্ক্যান সফল হয়েছে'
  
  



}