export const OmsIntlMessageCodesSinhala = {
    // components
    //1001- 6000
    1001: 'එකම සංරචකය සඳහා දත්ත ඇත',
    1002: 'සංරචකය "යාවත්කාලීන" : "සාදන ලදී" සාර්ථකව',
    1003: 'දත්ත හමු නොවිණි',
    1004: 'සංරචකය සාර්ථකව මකාදැමිනි',
    1005: 'මකා දැමිය නොහැක. සංරචකයන් දැනටමත් නිෂ්පාදිතයට මැප් කර ඇත',
    1006: "කරුණාකර සංරචක හැඳුනුම්පත ලබාදෙන්න",
  
    // product-type-service
    1011: 'තෝරාගත් සංරචකය නොපවතී',
    1012: 'නිෂ්පාදන වර්ගය "යාවත්කාලීන" : "සාදන ලදී" සාර්ථකව',
    1014: "මකා දැමිය නොහැක, නිෂ්පාදන වර්ගය දැනටමත් භාවිතයේ පවතී",
    1015: 'නිෂ්පාදන වර්ගය සාර්ථකව මකාදැමිනි',
    1016: "කරුණාකර නිෂ්පාදන වර්ග හැඳුනුම්පත ලබාදෙන්න",
    1023: "එකම නිෂ්පාදන වර්ගය සඳහා දත්ත ඇත",
    1024: 'නිෂ්පාදන වර්ගය "යාවත්කාලීන" : "සාදන ලදී" සාර්ථකව',
  
    // order-info-service
    1025: 'ඇණවුම නොපවතී',
    1026: 'උප නිෂ්පාදන සංයුක්තතා නොපවතී',
    1027: 'ඇණවුම් අංකය නොපවතී. කරුණාකර පරීක්ෂා කර නැවත උත්සාහ කරන්න!!!',
    1028: 'ඇණවුම් හැඳුනුම්පත ලබාදී නැත',
    1029: 'දෙන ලද හැඳුනුම්පත සඳහා ඇණවුම නොපවතී',
    1030: 'ශීර්ෂ තොරතුරු ලබා ගන්නා ලදී',
    1031: 'Po අනුක්‍රමික අංකය ලබාදී නැත',
    1032: 'නිෂ්පාදන ඇණවුම සඳහා ඇණවුම් ගුණාංග ලබා ගන්නා ලදී',
    1034: 'ප්‍රමාණ කේතය හමු නොවිණි',
    1035: 'නිෂ්පාදන වර්ගය මකා දැමිය නොහැක',
    1036: 'නිෂ්පාදන වර්ගය හමු නොවිණි',
    1038: 'ඩොකට් තොරතුරු සාර්ථකව ලබා ගන්නා ලදී',
    1039: "කරුණාකර ඇණවුම් හැඳුනුම්පත ලබාදෙන්න",
    1040: "පිළිවෙළක් සැලසුම් කිරීමේ ඇණවුම් තොරතුරු සාර්ථකව ලබා ගන්නා ලදී",
    1042: 'දත්ත ලබා ගන්නා ලදී',
    1044: 'දෙන ලද ඇණවුම් යොමු අංකය සඳහා ඇණවුම් තොරතුරු හමු නොවිණි',
    1045: 'දෙන ලද ඇණවුම් පේළි යොමු අංකය සඳහා ඇණවුම් තොරතුරු හමු නොවිණි',
    1046: 'උප පේළි තොරතුරු සාර්ථකව ලබා ගන්නා ලදී',
    1047: 'දෙන ලද po අනුක්‍රමික අංකය සඳහා ඇණවුම් තොරතුරු හමු නොවිණි',
    1050: "ඇසුරුම් ඇණවුම් තොරතුරු සාර්ථකව ලබා ගන්නා ලදී",
  
    // pre-integration service
    1051: 'මෙම අලෙවිකරණ ඇණවුම් තොරතුරු දැනටමත් පවතී.',
    1052: 'අලෙවිකරණ ඇණවුම් තොරතුරු සාර්ථකව සුරකින්නා ලදී.',
    1053: 'අලෙවිකරණ ඇණවුම් ලැයිස්තු තොරතුරු සාර්ථකව සුරකින්නා ලදී.',
    1054: 'අලෙවිකරණ ඇණවුම් ලැයිස්තුව සාර්ථකව ලබා ගන්නා ලදී.',
    1055: 'ඇණවුම් නිර්මාණය සඳහා කාර්යය සාර්ථකව එකතු කරන ලදී.',
  
    // product-prototype-info-service
    1056: 'අලෙවිකරණ ඇණවුම සඳහා නිෂ්පාදන දත්ත නොපවතී.',
    1057: 'නිෂ්පාදන තොරතුරු සාර්ථකව ලබා ගන්නා ලදී.',
  
    // product-prototype-service
    1058: 'නිෂ්පාදනය නොපවතී',
    1059: 'නිෂ්පාදනය දැනටමත් තහවුරු කර ඇත. ඔබට වෙනස් කිරීම් කළ නොහැක. නිෂ්පාදන තහවුරු කිරීම ආපසු ලබා නිවා නැවත උත්සාහ කරන්න',
    1060: 'උප නිෂ්පාදනය නොපවතී',
    1061: 'සංරචකයන් කපන ද්‍රව්‍ය වලට මැප් කර ඇත',
    1064: 'SKU සංරචක මැප් කිරීම තවමත් නොකෙරුණි, මකා දැමිය නොහැක',
    1065: 'සංරචකයන් කපන ද්‍රව්‍ය වලින් ඉවත් කරන ලදී',
    1067: 'උප නිෂ්පාදනය සඳහා තවමත් සංරචකයන් මැප් කර නැත',
    1068: 'නිෂ්පාදනය සාර්ථකව තහවුරු කරන ලදී',
    1069: 'SO අංකය ලබාදී නැත',
    1071: 'නිෂ්පාදනය තවමත් තහවුරු කර නැත',
    1072: 'මෙම SO සඳහා දැනටමත් නිෂ්පාදන ඇණවුම් නිර්මාණය කර ඇත',
    1073: 'නිෂ්පාදනය සාර්ථකව නැවත තහවුරු කරන ලදී',
    1074: 'SO සඳහා දැනටමත් නිෂ්පාදනය පවතී',
    1075: 'පෙරනිමි නිෂ්පාදනය සහ උප නිෂ්පාදනය සුරකින්නා ලදී',
    1076: 'ඇණවුම් හැඳුනුම්පත ලබාදී නැත',
    1077: 'ඇණවුම සඳහා නිෂ්පාදනය නොපවතී',
    1079: 'නිෂ්පාදනය සහ උප නිෂ්පාදනය මකාදැමිනි',
  
    // order manipulation service
    1081: 'ඇණවුම් අංකය නොපවතී. කරුණාකර පරීක්ෂා කර නැවත උත්සාහ කරන්න!!!',
    1082: 'ඇණවුම දැනටමත් තහවුරු කර ඇත. ඔබට වෙනස් කිරීම් කළ නොහැක',
    1083: 'වර්ණ ප්‍රමාණය දැනටමත් යාවත්කාලීන කර ඇත. කරුණාකර මකා නැවත උත්සාහ කරන්න',
  
  }
  