export const CpsIntlMessageCodesBangla = {
// ( cps → 16001-21000)
// BullQueueService common intl

// CutDispatchHelperService
16001: 'প্রদত্ত আইডির জন্য বিক্রেতা বিদ্যমান নেই',
16002: 'PO সংক্ষেপ বিদ্যমান নেই',
//CutDispatchService
16003: 'Lay ID অবশ্যই প্রদান করতে হবে',
16004: 'কিছু লেয়িং রেকর্ড বিদ্যমান নেই। পৃষ্ঠাটি রিফ্রেশ করুন এবং পুনরায় চেষ্টা করুন',
16005: 'কাট ডিসপ্যাচ অনুরোধ সফলভাবে তৈরি হয়েছে',
16006: 'কিছু প্রদত্ত কাট নম্বরের জন্য ডিসপ্যাচ অনুরোধ ইতিমধ্যে তৈরি করা হয়েছে',
16007: 'কাট বিদ্যমান নেই',
16008: 'ডকেটের জন্য কাট রিপোর্ট করা হয়নি: ${r.docketNumber}। মোট প্লাইস: ${r.plies} কাট রিপোর্ট প্লাইস: ${cutRepPlies}',
16009: 'EMB সম্পন্ন হয়নি। ডকেট: ${job.refDocket}, মূল পরিমাণ: ${jobQty}, অপারেশন: ${op.opCode}, স্ক্যান পরিমাণ: ${op.gQty}',
16010: 'ডিসপ্যাচ অনুরোধ ${cutDrRec.requestNumber} ইতিমধ্যে পাঠানো হয়েছে',
16011: 'কাট ডিসপ্যাচ অনুরোধ সফলভাবে মুছে ফেলা হয়েছে',
16012: 'প্রিন্ট স্ট্যাটাস সফলভাবে আপডেট হয়েছে',
16013: 'ডিসপ্যাচ ইতিমধ্যে সম্পন্ন হয়েছে। এটি পরিবর্তন করা যাবে না',
16014: 'বিক্রেতা বিদ্যমান নেই',
16015: 'কাট ডিসপ্যাচ অনুরোধের জন্য পরিবহন তথ্য আপডেট হয়েছে',
16016: 'কাট ডিসপ্যাচের জন্য বিক্রেতার বিবরণ আপডেট করা হয়নি',
16017: 'ডিসপ্যাচ অনুরোধের জন্য বিক্রেতার বিবরণ আপডেট করা হয়নি',
16018: 'কাট ডিসপ্যাচ স্ট্যাটাস সফলভাবে আপডেট হয়েছে',

//CutGenerationInfoService
16019: 'তথ্য পেতে অনুগ্রহ করে কাট নম্বর প্রদান করুন',
16020: 'প্রদত্ত কাটগুলি একাধিক কাট অর্ডারের। অনুগ্রহ করে একটি নির্দিষ্ট উত্পাদন অর্ডারের কাট প্রদান করুন',

16021: 'অনুরোধে কোনো ডকেট নেই',
16022: 'একটি ডকেটের জন্য কাট নম্বর পুনরুদ্ধার করা হয়েছে',
16023: 'মোট লেয়েড কাটের তথ্য পুনরুদ্ধার করা হয়েছে',

// CutGenerationService
16024: 'কিছু ডকেট কাট জেনারেশনের জন্য নিশ্চিত নয়',
16025: 'কাট জেনারেশনের জন্য কোনো খোলা প্রধান ফ্যাব্রিক ডকেট পাওয়া যায়নি',
16026: 'কাট মুছতে PoSerial প্রদান করা হয়নি',
16027: 'মোছার জন্য কোনো কাট পাওয়া যায়নি',
16028: 'উল্লিখিত কাট অর্ডারের কাট নম্বরগুলির জন্য কাট ডিসপ্যাচ ইতিমধ্যে তৈরি করা হয়েছে',
16029: 'কাটগুলি সফলভাবে মুছে ফেলা হয়েছে',

//CutReportingService
16030: 'এই লেয়িংয়ের জন্য কাট রিপোর্ট ইতিমধ্যে ${text}',
16031: 'রোল ছাড়া কাট রিপোর্টিং অনুমোদিত নয়',
16032: 'কাট রিপোর্টিং সফলভাবে ট্রিগার হয়েছে',
16033: 'লেয়িং রেকর্ড বিদ্যমান নেই',
16034: 'এই লেয়িংয়ের জন্য লেয়িং নিশ্চিত নয়',

16035: 'এই ডকেটের জন্য কাট প্রক্রিয়াধীন: ${ rec.docketGroup } লেয়িং নম্বর: ${ rec.id }',
16036: 'বর্তমান PO-র অধীনে ডকেট ${ r.docketGroup } রিপোর্ট করা হচ্ছে: বর্তমান অবস্থা: ${ r.cutStatus }। এটি সম্পন্ন না হওয়া পর্যন্ত আপনি এগোতে পারবেন না',

16037: 'ডকেট গ্রুপ ${ layInfo.docketGroup } এর জন্য কোনো ডকেট পাওয়া যায়নি',
16038: 'শেষ প্যানেল পাওয়া যায়নি: ${ prodName } : ${ fgColor } : ${ size } : ${ comp }',
16039: 'সকল বান্ডেলের জন্য কাট রিপোর্টিং সফলভাবে ট্রিগার হয়েছে',
16040: 'আসল প্যানেল নম্বর পাওয়া যায়নি',
16041: 'PO প্যানেল নম্বর পাওয়া যায়নি',
16042: 'লেয়িং রেকর্ড বিদ্যমান নেই',

16043: 'ADB বিদ্যমান নেই',
16044: 'বান্ডেল ইতিমধ্যে কাট রিপোর্ট করা হয়েছে',
16045: 'শেড প্লাইস উপলব্ধ নেই',
16046: 'আসল প্যানেল তৈরি করার সময় রঙ ও আকারের প্যানেল মিলছে না',
16047: 'আসল প্যানেল তৈরি করার সময় FG নম্বর মিলছে না',
16048: 'কাট সফলভাবে রিপোর্ট করা হয়েছে',
16049: 'লেয়িং রেকর্ড বিদ্যমান নেই',

16050: 'কাট অবশ্যই রিপোর্টের বিপরীত ক্রমে ফেরত দিতে হবে, সর্বশেষ রিপোর্ট করা কাটটি প্রথমে ফেরত দিতে হবে',
16051: 'এই ডকেটের জন্য কাট প্রক্রিয়াধীন: ${ rec.docketGroup } লেয়িং নম্বর: ${ rec.id }',
16052: 'এই লেয়িংয়ের জন্য কাট রিপোর্টিং সম্পন্ন হয়নি',
16053: 'কাট রিভার্সিং সফলভাবে ট্রিগার হয়েছে',

16054: 'এই লেয়িংয়ের জন্য কাট রিপোর্টিং রিভার্সাল ট্রিগার হয়নি',
16055: 'কাট সফলভাবে রিভার্স হয়েছে',
16056: 'এই লেয়িংয়ের জন্য কাট রিপোর্টিং করা হয়নি',
16057: 'ভোগ্য স্টক সফলভাবে আপডেট হয়েছে',

//DocketGenerationInfoService
16058: 'ডকেট নিশ্চিতকরণের তালিকা সফলভাবে পুনরুদ্ধার হয়েছে',
16059: 'মার্কার নির্দিষ্ট ডকেট নম্বর পুনরুদ্ধার করা হয়েছে',
16060: 'PO-এর জন্য ডকেটের তথ্য সফলভাবে পুনরুদ্ধার হয়েছে',
16061: 'ডকেট নম্বর প্রদান করা হয়নি',
16062: 'ডকেটের বিস্তারিত তথ্য পুনরুদ্ধার করা হয়েছে',

// DocketMaterialService
16106: 'উপকরণ সফলভাবে আনলক করা হয়েছে',
16107: 'উপকরণ সফলভাবে বরাদ্দ করা হয়েছে',

16109: 'রোল ${eachRoll.rollId} প্যাকিং তালিকায় পাওয়া যায়নি। অনুগ্রহ করে যাচাই করুন',
16110: 'কেউ ইতিমধ্যে ডকেট তৈরি/মুছে ফেলা/নিশ্চিতকরণের প্রক্রিয়া চালু করেছে। অনুগ্রহ করে পুনরায় চেষ্টা করুন',
16111: 'রোল ${eachRoll.rollId} জন্য বিদ্যমান পরিমাণের চেয়ে বেশি পরিমাণ বরাদ্দ করা হচ্ছে',
16112: 'ডকেট নম্বর এবং উপাদান অনুরোধ নম্বর আবশ্যক',

16113: 'গুদাম দল ইতিমধ্যে অনুরোধের উপর কাজ শুরু করেছে। এখন আপনি পরিবর্তন করতে পারবেন না',
16114: 'লেয়িং অপারেশন ইতিমধ্যে শুরু হয়েছে। এখন আপনি পরিবর্তন করতে পারবেন না',

16115: 'অনুরোধ ${req.materialRequestNo} ইতিমধ্যে কাট টেবিল ${docPlanRec.resourceDesc}-এ পরিকল্পিত',
16116: 'গুদাম ইতিমধ্যে এই অনুরোধে কাজ শুরু করেছে। আপনি এখন পরিবর্তন করতে পারবেন না',
16117: 'অনুরোধ নম্বর ${req.materialRequestNo} এর সাথে কোনো ডকেট সংযুক্ত নেই',
16118: 'ডকেট উপাদান স্থিতি সফলভাবে পরিবর্তিত হয়েছে',

16133: 'আসল মার্কার আপডেট করা হয়নি',
//DocketPlanningInfoService
16135: 'কোনও চলমান ডকেট অনুরোধ পাওয়া যায়নি',
16136: 'ডকেটের তথ্য পুনরুদ্ধার করা হয়েছে',
16137: "প্রদত্ত তারিখ সীমার জন্য কোনও তথ্য পাওয়া যায়নি",

//DocketPlanningService
16139: 'ডকেট অনুরোধ ইতিমধ্যে পরিকল্পনা টেবিলে তৈরি করা হয়েছে',
16140: 'ডকেট অনুরোধ অপেক্ষমান কাট টেবিল তালিকায় যোগ করা হয়েছে',
16141: 'ডকেট অনুরোধ পরিকল্পনা টেবিলে তৈরি করা যায়নি',
16142: 'অনুরোধ ${req.materialRequestNo} ইতিমধ্যে কাট টেবিলে পরিকল্পিত হয়েছে ${docPlanRec.resourceDesc}',
16143: 'অনুরোধ ${req.materialRequestNo} ইতিমধ্যে গুদামে পাঠানো হয়েছে। অনুগ্রহ করে ডকেটটি আনপ্ল্যান করে আবার চেষ্টা করুন',
16144: 'ডকেট অনুরোধ অপেক্ষমান কাট টেবিল তালিকা থেকে সরানো হয়েছে',
16145: 'আপনি একবারে কেবল ১টি অনুরোধ পরিকল্পনা করতে পারেন',
16146: 'অনুরোধ ${currPlanningDoc.matReqNo} অপেক্ষমান কাট টেবিল তালিকায় নেই',
16147: 'অনুরোধ ${currPlanningDoc.matReqNo} ইতিমধ্যে ${reqRecord.resourceDesc}-এ পরিকল্পিত হয়েছে',
16148: 'প্রদত্ত টেবিল আইডি : ${req.tableId} বিদ্যমান নেই',
16149: 'ডকেট অনুরোধ কাট টেবিলে পরিকল্পিত হয়েছে',
16150: 'অনুরোধ ${currPlanningDoc.matReqNo} বিদ্যমান নেই',
16151: 'অনুরোধ ${currPlanningDoc.matReqNo} ইতিমধ্যে সম্পন্ন হয়েছে। আপনি এটি আনপ্ল্যান করতে পারবেন না',
16152: 'ডকেট ${currPlanningDoc.docketGroup} এবং অনুরোধ ${currPlanningDoc.matReqNo} এর জন্য উপকরণ অনুরোধ করা হয়েছে',
16153: 'গুদাম দল ইতিমধ্যে অনুরোধে কাজ শুরু করেছে। আপনি এটি আনপ্ল্যান করতে পারবেন না',
16154: 'অনুরোধ সফলভাবে আনপ্ল্যান করা হয়েছে',
16155: 'ডকেটটি এখনও পরিকল্পিত হয়নি বা ইতিমধ্যে সম্পন্ন হয়েছে',

16158: 'অনুরোধ নতুন টেবিলে সফলভাবে পরিকল্পিত হয়েছে',

16160: 'অনুরোধ ${currPlanningDoc.matReqNo} ইতিমধ্যে সম্পন্ন হয়েছে। আপনি অগ্রাধিকার পরিবর্তন করতে পারবেন না',
16161: 'অগ্রাধিকার সফলভাবে পরিবর্তিত হয়েছে',
16162: 'অনুরোধ ${req.materialRequestNo} বিদ্যমান নেই',
16163: 'অনুরোধ ${req.materialRequestNo} এর জন্য উপকরণ ইতিমধ্যে অনুরোধ করা হয়েছে',
16164: 'ডকেটের জন্য উপকরণ অনুরোধ করা হয়েছে',

16166: 'অনুরোধ ${req.materialRequestNo} এর জন্য উপকরণ অনুরোধ করা হয়নি',
16167: 'অনুরোধ ${req.materialRequestNo} এর জন্য অনুরোধকৃত উপকরণ গুদাম দলের কাছে পাঠানো হয়নি। অনুগ্রহ করে যাচাই করুন এবং তারপর ডি-অ্যালোকেট করুন',
16168: 'ডকেটের জন্য উপকরণ সফলভাবে বাতিল করা হয়েছে',

//LayReportingInfoService
16169: 'ডকেটের জন্য কোনও লেয়িং রিপোর্ট করা হয়নি',
16171: 'অনুরোধে ডকেট নম্বর প্রদান করা হয়নি',
16172: 'লায় বিদ্যমান নেই অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16173: 'ডকেট বিদ্যমান নেই অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16174: 'বাস্তব ডকেট বান্ডিল তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
16175: "শেষ অংশের তথ্য পুনরুদ্ধার করা হয়েছে",
16176: 'কাটিং তালিকা সফলভাবে পুনরুদ্ধার করা হয়েছে',

//LayReportingService
16177: 'ডকেট তথ্য পাওয়া যায়নি। অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16178: 'গুদাম থেকে উপকরণ এখনও ইস্যু করা হয়নি',
16179: 'একটি লেয় ইতিমধ্যে শুরু হয়েছে। এটি কাটিং সম্পন্ন না করা পর্যন্ত নতুন লেয় যোগ করা যাবে না',
16180: 'সমস্ত ডকেট প্লাই লেয় করা হয়েছে',
16181: 'ডকেট সহ লেয় সফলভাবে শুরু হয়েছে',
16182: 'প্রদত্ত লেয় প্রক্রিয়াধীন নয়। অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16183: 'কারণের বিবরণ পাওয়া যায়নি। অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16184: 'লেয় সফলভাবে বিরতি দেওয়া হয়েছে',
16185: 'প্রদত্ত লেয় হোল্ডে নেই। অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16186: 'ডাউনটাইম এখনও লগ করা হয়নি। অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16187: 'ডাউনটাইম ইতিমধ্যে সম্পন্ন হয়েছে। আপনি এটি পুনরায় চালু করতে পারবেন না',
16188: 'লেয় সফলভাবে পুনরায় চালু করা হয়েছে',
16189: 'কিছু ওপেন MRN অনুরোধ রয়েছে, অনুগ্রহ করে সেগুলি বন্ধ করুন এবং পুনরায় চেষ্টা করুন',
16190: 'লেয় সফলভাবে নিশ্চিত করা হয়েছে',
16191: 'যদি রোল ${r.itemBarcode} এর জন্য কোনও ক্ষতি না থাকে, তবে প্লাই এবং সিকোয়েন্স বাধ্যতামূলক',
16192: 'কেউ লেয় হোল্ড করেছে বা এটি ইতিমধ্যে নিশ্চিত করা হয়েছে, অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16193: 'কিছু ওপেন MRN অনুরোধ রয়েছে, অনুগ্রহ করে এগুলো ইস্যু করুন এবং পুনরায় চেষ্টা করুন',
16194: 'প্রদত্ত ডকেটের জন্য কোনও উপকরণ পাওয়া যায়নি, অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16195: 'ডকেটের মাত্র ${docketRecord.plies} প্লাই রয়েছে। আপনি ${totalLayedPlies + totalLayedPliesValue} প্লাই রিপোর্ট করতে যাচ্ছেন',
16196: 'রোলটি প্রদত্ত উপকরণ অনুরোধের অন্তর্ভুক্ত নয়, অনুগ্রহ করে যাচাই করুন এবং পুনরায় চেষ্টা করুন',
16197: 'রোল সফলভাবে যোগ করা হয়েছে',

16198: 'লায় হোল্ড অবস্থায় রয়েছে, আপনি রোল মুছতে পারবেন না',
16199: 'রোল সফলভাবে মুছে ফেলা হয়েছে',
16200: 'লায় আইডি প্রদান করা আবশ্যক',

16201: 'লায় এর জন্য বান্ডিল ট্যাগ ইতিমধ্যে মুদ্রিত হয়েছে',
16202: 'বারকোড সফলভাবে মুদ্রিত হয়েছে',

16203: 'লায় এর জন্য বান্ডিল ট্যাগ ইতিমধ্যে মুক্ত করা হয়েছে',
16204: 'বারকোড সফলভাবে মুক্ত করা হয়েছে',

//CutTableService
16205: "শুরুর এবং শেষের স্থানে স্পেস অনুমোদিত নয়",
16206: "একই কাট টেবিলের সাথে তথ্য বিদ্যমান",
16207: 'কাট টেবিল "আপডেট" : "তৈরি" সফলভাবে',
16208: "অনুগ্রহ করে কাট টেবিল আইডি দিন",
16209: "কাট টেবিল তথ্য পাওয়া যায়নি",
16210: 'কাট টেবিল ইতিমধ্যে ব্যবহারে রয়েছে। এটি মুছে ফেলা যাবে না',
16211: 'কাট টেবিল সফলভাবে মুছে ফেলা হয়েছে',

//CutGenerationService
16313: 'PO এর জন্য কোন নিটিং কাজ বিদ্যমান নেই',
16314: 'কিছু নিটিং কাজ কাটিং তৈরির জন্য নিশ্চিত নয়',
16315: 'কোনও ওপেন প্রধান আইটেম নিটিং কাজ পাওয়া যায়নি',
16316: "নিটিং কাট সফলভাবে তৈরি হয়েছে",

//Cut Reporting Service
16317: 'ডকেটের জন্য লেয়িং রেকর্ড নেই',
16318: 'ডকেট ${rec.docketGroup} এর জন্য কাটিং প্রক্রিয়াধীন রয়েছে, লেয় নম্বর: ${rec.id}',
16319: 'ডকেট ${r.docketGroup} বর্তমান PO তে রিপোর্ট করা হচ্ছে, বর্তমান অবস্থা: ${r.cutStatus}. সম্পন্ন না হওয়া পর্যন্ত আপনি এগিয়ে যেতে পারবেন না',
16320: 'এই লেয়িং-এর জন্য কাট রিপোর্টিং ট্রিগার করা হয়নি',
16321: 'লায়িং রেকর্ড বিদ্যমান নেই',


}
























  