export const CpsIntlMessageCodesSinhala= {
// ( cps → 16001-21000)
// BullQueueService common intl

// CutDispatchHelperService
16001: 'ලබා දී ඇති ID සඳහා සැපයුම්කරු නොපවතී',
16002: 'Po සංඛ්‍යා ලේඛනය නොපවතී',

//CutDispatchService
16003: 'Lay ID ලබාදිය යුතුය',
16004: 'සමහර lay වාර්තා නොපවතී. පිටුව නැවත පූරණය කර නැවත උත්සාහ කරන්න',
16005: 'කප්පාදු යැවීමේ ඉල්ලීම සාර්ථකව සෑදියි',
16006: 'ලබාදිය ඇති සමහර කට් නම සඳහා දැනටමත් යැවීමේ ඉල්ලීමක් ඇත',
16007: 'කප්පාදු නොපවතී',
16008: 'Docket : ${r.docketNumber} සඳහා cut වාර්තා වී නැත. මුළු Plies: ${r.plies}, cut වාර්තා Plies: ${cutRepPlies}',
16009: 'EMB අවසන් වී නැත. Docket: ${job.refDocket}, මුළු ප්‍රමාණය: ${jobQty}, ක්‍රියාව: ${op.opCode}, scan ප්‍රමාණය: ${op.gQty}',
16010: 'Dispatch ඉල්ලීම ${cutDrRec.requestNumber} දැනටමත් යවා ඇත',
16011: 'Cut dispatch ඉල්ලීම මකා ඇත',
16012: 'මුද්‍රණ තත්ත්වය යාවත්කාලීන කරන ලදි',
16013: 'Dispatch දැනටමත් සිදු වී ඇත. එය වෙනස් කළ නොහැක',
16014: 'සැපයුම්කරු නොපවතී',
16015: 'Cut dispatch ඉල්ලීම සඳහා ප්‍රවාහන තොරතුරු යාවත්කාලීන කරන ලදි',
16016: 'Cut dispatch සඳහා සැපයුම්කරුගේ විස්තර යාවත්කාලීන කර නැත',
16017: 'Dispatch ඉල්ලීම සඳහා සැපයුම්කරුගේ විස්තර යාවත්කාලීන කර නැත',
16018: 'Cut dispatch තත්ත්වය සාර්ථකව යාවත්කාලීන කරන ලදි',

//CutGenerationInfoService
16019: 'Cut තොරතුරු ලබා ගැනීමට cut අංක ලබාදිය යුතුය',
16020: 'ලබාදිය ඇති cuts බොහෝ cut orders වලට අයත් වේ. කරුණාකර එකම production order එකේ cuts ලබාදිය යුතුය',
16021: 'ඉල්ලීම තුළ dockets ලබාදී නැත',
16022: 'Docket සඳහා cut අංකය ලබාගන්නා ලදි',
16023: 'මුළු Layed Cuts දත්ත ලබාගන්නා ලදි',

//CutGenerationService
16024: 'සමහර dockets cut generation සඳහා තහවුරු කර නැත',
16025: 'Cut generation සඳහා විවෘත මූලික වියන docket එකක් හමු නොවීය',
16026: 'Cuts මැකීමට PoSerial ලබාදී නැත',
16027: 'මැකීමට cuts හමු නොවීය',
16028: 'Cut dispatch දැනටමත් cut order එකේ cut අංක සඳහා සෑදී ඇත',
16029: 'Cuts සාර්ථකව මකා ඇත',

//CutReportingService
16030: 'මෙම laying සඳහා cut reporting දැනටමත් ${text}',
16031: 'Roll නොමැති cut reporting ඉඩ නොදිය හැක',
16032: 'Cut reporting සාර්ථකව ආරම්භ කරන ලදි',
16033: 'Laying වාර්තා නොපවතී',
16034: 'මෙම lay සඳහා laying තහවුරු කර නැත',
16035: 'Docket ${rec.docketGroup} සඳහා cut ක්‍රියාවලිය සිදු වෙමින් පවතී. Laying අංකය: ${rec.id}',
16036: 'Docket ${r.docketGroup} දැනටමත් cut reporting සිදු වෙමින් පවතී. තත්ත්වය: ${r.cutStatus}. එය අවසන් වන තෙක් ඔබට ඉදිරියට යා නොහැක',
16037: 'Docket Group ${layInfo.docketGroup} සඳහා dockets හමු නොවීය',
16038: '${prodName} : ${fgColor} : ${size} : ${comp} සඳහා අවසාන panel හමු නොවීය',
16039: 'සියලුම bundles සඳහා cut reporting සාර්ථකව සිදු කරන ලදි',
16040: 'සැබෑ panel අංක හමු නොවීය',
16041: 'Po panel අංක හමු නොවීය',
16042: 'Laying වාර්තා නොපවතී',
16043: 'ADB නොපවතී',
16044: 'Bundle එක දැනටමත් cut report කර ඇත',
16045: 'Shade plies නොමැත',
16046: 'Color සහ size panel ගැලපීමේ ගැටළුවක් ඇත',
16047: 'FG අංක ගැලපීමේ ගැටළුවක් ඇත',
16048: 'Cut වාර්තා සාර්ථකයි',
16049: 'Laying වාර්තා නොපවතී',
16050: 'Cut reporting reverse කිරීම සඳහා අවසාන cut reporting කල කට් reversing කළ යුතුය',
16051: 'Docket ${rec.docketGroup} සඳහා cut ක්‍රියාවලිය සිදු වෙමින් පවතී',
16052: 'මෙම laying සඳහා cut reporting අවසන් කර නැත',
16053: 'Cut reversing සාර්ථකව ආරම්භ කරන ලදි',
16054: 'මෙම laying සඳහා cut reporting reversal ආරම්භ කර නැත',
16055: 'Cut reversing සාර්ථකව සිදු කරන ලදි',
16056: 'මෙම laying සඳහා cut reporting සිදු කර නැත',
16057: 'භාවිතා කළ තොගය සාර්ථකව යාවත්කාලීන කරන ලදි',

//DocketGenerationInfoService
16058: 'Docket තහවුරු කිරීමේ ලැයිස්තුව සාර්ථකව ලබාගන්නා ලදි',
16059: 'Marker විශේෂිත docket අංක ලබාගන්නා ලදි',
16060: 'PO සඳහා docket විස්තර සාර්ථකව ලබාගන්නා ලදි',
16061: 'Docket අංකය ලබාදී නැත',
16062: 'Docket විස්තර ලබාගන්නා ලදි',

//DocketGenerationService
16063: 'PO Docket serial එකේ දත්ත නොමැත. කරුණාකර පිරික්සා නැවත උත්සාහ කරන්න',
16064: 'මෙම අනුපාතය සඳහා dockets දැනටමත් ජනනය කර ඇත',
16065: 'Docket තහවුරු කිරීම සිදු වෙමින් පවතී. කරුණාකර පිරික්සා නැවත උත්සාහ කරන්න',
16066: 'ලබාදී ඇති අනුපාතය සඳහා docket ජනනය දැනටමත් සම්පූර්ණය වී ඇත හෝ සිදු වෙමින් පවතී',
16067: 'Dockets ජනනය කිරීමට පෙර markers පැවරිය යුතුය',
16068: 'Docket ජනනය / මකාදැමීම / තහවුරු කිරීම කෙනෙකු මීට පෙර ආරම්භ කර ඇත. කරුණාකර නැවත උත්සාහ කරන්න',
16069: 'Dockets සාර්ථකව ජනනය කරන ලදි',
16070: 'ලබාදී ඇති docket අංකය සඳහා dockets විස්තර හමු නොවීය. කරුණාකර පිරික්සා නැවත උත්සාහ කරන්න',

//LayReportingService
16177: 'Docket තොරතුරු හමු නොවීය. කරුණාකර පිරික්සා නැවත උත්සාහ කරන්න',
16178: 'Material තවමත් ගබඩාවේ සිට නිකුත් කර නැත',
16179: 'Lay දැනටමත් ආරම්භ කර ඇත. නැවත lay එකක් එක් කළ නොහැක',
16180: 'සියලුම docket plies lay කර ඇත',
16181: 'Docket සමඟ lay ආරම්භ කරන ලදි',

//CutTableService
16205: 'ආරම්භය සහ අවසානයේ ඉඩ නොතබාම තිබිය යුතුය',
16206: 'එකම CutTable එකක් දැනටමත් පවතී',
16207: 'CutTable සාර්ථකව "යාවත්කාලීන / සෑදිය" ලදි',
16208: 'කරුණාකර CutTable Id ලබාදිය යුතුය',
16209: 'CutTable දත්ත හමු නොවීය',
16210: 'Cut Table දැනටමත් භාවිතයේ ඇත. මකා දැමිය නොහැක',
16211: 'CutTable සාර්ථකව මකා ඇත',
//CutTableHelperService

16214: 'නැවතුම් ඉල්ලීම් සොයාගත නොහැක',
16215: 'කපන නැවතුම් ඉල්ලීම සොයාගත නොහැක',
16216: 'නැවතුම් දැනටමත් සම්පූර්ණයි.',
16217: 'කරුණාකර නැවතුම් හැඳුනුම් අංකය ලබාදෙන්න',
16218: 'කපන නැවතුම් ඉල්ලීම සාර්ථකව සුරකින්න',
16219: 'කපන නැවතුම් ඉල්ලීම ලබාගන්නා ලදි',
16220: 'කපන තොරතුරු ලබාගන්නා ලදි',
16221: 'දොකට්ස් මෙම PO සඳහා නොපවතී',
16222: 'කප්පම් සාර්ථකව ජනනය කරන ලදි',
16223: 'දොකට් සඳහා ආලේපන වාර්තා නොපවතී',
16224: 'මෙම ආලේපනය සඳහා කපන වාර්තා සක්‍රීය කර නැත',
16225: 'කරුණාකර ආලේපන හැඳුනුම් අංකය ලබාදෙන්න',
16226: 'නිශ්චිත PO සහ නිෂ්පාදන නාමය සඳහා දොකට් සොයාගත නොහැක',
16227: 'දොකට් තොරතුරු සාර්ථකව ලබාගන්නා ලදි',
16288: 'දොකට් කණ්ඩායම ලබාදෙන ලදී',
16289: 'දොකට් කණ්ඩායම සඳහා දොකට් නොමැත',
16290: 'දොකට් කණ්ඩායමේ විස්තර ලබාගන්නා ලදි',
16291: 'කපන කාණ්ඩ තොරතුරු සාර්ථකව ලබාගන්නා ලදි',
16292: 'දොකට් තහවුරු ලැයිස්තුව සාර්ථකව ලබාගන්නා ලදි',
16293: 'සුදුසු කපන කාණ්ඩ විස්තර සාර්ථකව ලබාගන්නා ලදි',

16295: 'කපන පැනල් තොරතුරු සාර්ථකව ලබාගන්නා ලදි',
16296: 'දොකට් තහවුරු කිරීම තවදුරටත් ක්‍රියාවේ පවතී. කරුණාකර රැදී සිටීමෙන් පසුව නැවත උත්සාහ කරන්න',
16297: 'දොකට් දී ඇති අංකය සඳහා දොකට් කාණ්ඩ දැනටමත් සාදන ලදි. කරුණාකර පරීක්ෂා කර නැවත උත්සාහ කරන්න',
16298: 'සමහර අනුපාත සඳහා දොකට් සාදන ලදේ නැත. කරුණාකර පරීක්ෂා කර නැවත උත්සාහ කරන්න',
16299: 'දොකට් සාර්ථකව තහවුරු කරන ලදි',
16300: 'ලබාදිය නොහැකි ද්‍රව්‍ය සඳහා ගබඩා ඉතිරිවීම් නොපවතී. කරුණාකර නැවත උත්සාහ කරන්න',

//DocketMaterialHelperService
16301: 'මහත ගබඩා රෝල් තොරතුරු සාර්ථකව ලබාගන්නා ලදි.',
16302: 'ලබාදිය නොහැකි රෝල් හැඳුනුම් අංකය සඳහා නිකුත් කිරීමේ විස්තර නොමැත',
16303: 'සම්පූර්ණ ලේයඩ් මීටර ප්‍රමාණය ලබාගන්නා ලදි',

//DocketMaterialService
16304: 'දොකට් සඳහා ඉල්ලීම් නොමැත',
16305: 'දොකට් ඉල්ලීම සාර්ථකව මකාදැමන ලදි',
16306: 'ලබාදිය නොහැකි රෝල් හැඳුනුම් අංක සඳහා වෙන්කරන ප්‍රමාණය සාර්ථකව යාවත්කාලීන කරන ලදි',

//DocketPlanningService
16307: 'කපන මේසය සඳහා දොකට් ලබාගන්නා ලදි',
16308: 'සම්පූර්ණ ලේයඩ් මීටර ප්‍රමාණය සාර්ථකව ලබාගන්නා ලදි',

//LayReportingInfoService
16309: 'දොකට් සඳහා ආලේපන තොරතුරු ලබාගන්නා ලදි',
16310: 'දොකට් දැනටමත් තහවුරු කර ඇත',

16312: 'සමහර ආලේපන අංක නොපවතී',

//CutGenerationService
16313: 'දොකට් සඳහා PO සඳහා රෙදි වැඩ නොපවතී',
16314: 'සමහර රෙදි වැඩ කපන සැලසුම් කිරීම සඳහා තහවුරු කර නැත',
16315: 'ප්‍රධාන අයිතම කපන සැලසුම් සඳහා විවෘත රෙදි වැඩ නොපවතී',
16316: 'කපන රෙදි සාර්ථකව සාදන ලදි',

//cut reporting service
16317: 'දොකට් සඳහා ආලේපන වාර්තා නොපවතී',
16318: 'මෙම දොකට් කණ්ඩායම: ${rec.docketGroup} සඳහා කපන වැඩ සිදු වෙමින් පවතී. ආලේපන අංකය: ${rec.id}',
16319: 'වත්මන් PO යටතේ ${r.docketGroup} දොකට් වාර්තා කරමින් පවතී. වත්මන් තත්ත්වය: ${r.cutStatus}. ඔබට මෙය අවසන් වන තෙක් ඉදිරියට යා නොහැක',
16320: 'මෙම ආලේපනය සඳහා කපන වාර්තා සක්‍රීය කර නැත',
16321: 'ආලේපන වාර්තා නොපවතී',
}
   