
export const PkmsIntlMessageCodesSinhala= {
//pkms → 36001-41000

// MaterialTypeService
36001: 'ද්‍රව්‍ය වර්ගය සාර්ථකව සුරකිණි',
36002: "ද්‍රව්‍ය වර්ග කේතය දැනටමත් පවතී.",

36003: 'ද්‍රව්‍ය වර්ග දත්ත සාර්ථකව ලබාගන්නා ලදී',
36004: 'අයිතම දත්ත සාර්ථකව ලබාගන්නා ලදී',

// ItemsService
36005: "අයිතම කේතය දැනටමත් පවතී.",
36006: 'අයිතම දත්ත සාර්ථකව ලබාගන්නා ලදී',

36007: 'ඇසුරුම් කරන ලද පිරිවිතර දත්ත සාර්ථකව ලබාගන්නා ලදී',

// PackTableService
36008: "කරුණාකර වගු නාමයට පෙර ඉඩ ඉවත් කරන්න", 
36009: "කරුණාකර වගු නාමයෙන් පසු ඉඩ ඉවත් කරන්න", 
36010: '"${rec.tableName}" නමින් PackTable දැනටමත් පවතී.',
36011: '"${rec.tableName}" නමින් PackTable දැනටමත් පවතී.',
36012: 'Pack Table හි කාර්ය ඉල්ලීමක් නිර්මාණය කර නැත',
36013: 'ඉල්ලීම ${reqModel.packTableId} දැනටමත් ${deletePackTable.workStationDesc} කපා ඇති වගුව සඳහා සැලසුම් කර ඇත',
36014: 'ඉල්ලීම ${reqModel.jobNumber} දැනටමත් PackTable වෙත යවා ඇත. කරුණාකර jobNumber අසල සංවෘත කර නැවත උත්සාහ කරන්න',
36015: 'PackTable සාර්ථකව මකා දමන ලදී',

// PackTypeService
36016: 'ද්‍රව්‍ය වර්ගය සාර්ථකව සුරකිණි',
36017: "Pack වර්ග කේතය දැනටමත් පවතී.",
36018: 'Pack වර්ග දත්ත සාර්ථකව ලබාගන්නා ලදී',
36019: 'Pack වර්ග දත්ත සාර්ථකව ලබාගන්නා ලදී',
36020: 'අයිතම දත්ත සාර්ථකව ලබාගන්නා ලදී',

// PackJobService
36021: 'ඉල්ලීම ${currPlanningJOb.packJobNumber} නොපවතී',
36022: 'ඉල්ලීම ${currPlanningJOb.packJobNumber} දැනටමත් සම්පූර්ණ කර ඇත. ඔබට එය නැවත සැලසුම් කළ නොහැක',
36023: 'ඉල්ලීම සාර්ථකව නැවත සැලසුම් කරන ලදී',
36024: 'පවතින හෝ සම්පූර්ණ කළ Pack Job ඉල්ලීම් නොමැත',
36025: 'Pack Table සාර්ථකව සැලසුම් කරන ලදී',

36026: "ඔබට එක් අවස්ථාවක එක් ඉල්ලීමක් පමණක් සැලසුම් කළ හැක", 
36027: "PackJob නොමැත", 
36028: "PackJob දැනටමත් PackTable එකට සබැඳිව ඇත", 
36029: "දෙන ලද වගු හැඳුනුම් අංකය නොපවතී", 
36030: 'Pack Job Pack Table සඳහා සැලසුම් කරන ලදී',

// PackingMaterialReqService
36031: 'Pack ලැයිස්තුව සාර්ථකව සුරකිණි',
36032: 'ද්‍රව්‍ය ඉල්ලීම් හමු නොවීය',
36033: 'Pack ද්‍රව්‍ය සාර්ථකව ලබාගන්නා ලදී',
36034: 'සබැඳි අයිතම නොමැත',
36035: 'Pack ද්‍රව්‍ය සංචිප්තය ලබා ගෙන ඇත',
36036: "කරුණාකර වලංගු ද්‍රව්‍ය ඉල්ලීමේ හැඳුනුම් අංකය ලබාදෙන්න", 

// PackingMaterialReqInfoService
36038: 'දෙන ලද Pack ලැයිස්තුව සඳහා දත්ත නොමැත',

// InspectionPreferenceService
36039: 'Pack ලැයිස්තුව හමු නොවීය',
36040: 'සාර්ථකව සුරකිණි',
36041: 'Packing ලැයිස්තු ශීර්ෂය හමු නොවීය. කරුණාකර පරීක්ෂා කරන්න.',
36042: 'පරීක්ෂාව සාර්ථකව තහවුරු කරන ලදී.',
36043: "පරීක්ෂණයට රඳවා ඇති ද්‍රව්‍ය සාර්ථකව ලබාගන්නා ලදී", 
36044: 'පරීක්ෂණ ඉල්ලීම වලංගු නොවේ',
36045: 'පරීක්ෂණ ප්‍රවාහය වැරදියි. PENDING -> MATERIAL RECEIVED -> PROGRESS -> COMPLETED',

// CartonContainerMappingService
36099: 'Carton කන්ටේනරයෙන් ඉවත් කරන ලදී',
36100: 'Carton හැඳුනුම් අංකය ලබාදී නොමැත',
36101: 'Carton තෝරාගත් කන්ටේනරය සමඟ සබැඳි නොවේ.',
36102: 'Carton ඇතුළත් කරන්න',
36103: 'උපරිම කන්ටේනර Carton ධාරිතාව අර්ථ දක්වා නොමැත',
36104: 'Pack ලැයිස්තුව සඳහා කන්ටේනර කණ්ඩායම් සබැඳි කර නැත',
36105: 'කන්ටේනර කණ්ඩායම් තොරතුරු සාර්ථකව ලබාගන්නා ලදී',
}