
export const PkmsIntlMessageCodesBangla= {
    // pkms → 36001-41000


// MaterialTypeService
36001: 'উপাদান প্রকার সফলভাবে সংরক্ষণ করা হয়েছে',
36002: "উপাদান প্রকার কোড ইতিমধ্যে বিদ্যমান।",

36003: 'উপাদান প্রকারের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
36004: 'আইটেমের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

// ItemsService
36005: "আইটেম কোড ইতিমধ্যে বিদ্যমান।",
36006: 'আইটেমের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

36007: 'প্যাকিং স্পেকের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

// PackTableService
36008: "অনুগ্রহ করে টেবিল নামের পূর্বে স্পেস সরিয়ে ফেলুন",
36009: "অনুগ্রহ করে টেবিল নামের পরে স্পেস সরিয়ে ফেলুন",
36010: 'প্যাকটেবিল "${rec.tableName}" নাম সহ ইতিমধ্যে বিদ্যমান।',
36011: 'প্যাকটেবিল "${rec.tableName}" নাম সহ ইতিমধ্যে বিদ্যমান।',
36012: 'প্যাক টেবিলে কাজের অনুরোধ তৈরি করা হয়নি',
36013: 'অনুরোধ ${reqModel.packTableId} ইতিমধ্যে কাট টেবিল ${deletePackTable.workStationDesc}-তে পরিকল্পিত হয়েছে',
36014: 'অনুরোধ ${reqModel.jobNumber} ইতিমধ্যে প্যাক টেবিলে পাঠানো হয়েছে। অনুগ্রহ করে কাজের নম্বরটি আনপ্ল্যান করুন এবং পুনরায় চেষ্টা করুন',
36015: 'প্যাক টেবিল সফলভাবে মুছে ফেলা হয়েছে',

// PackTypeService
36016: 'উপাদান প্রকার সফলভাবে সংরক্ষণ করা হয়েছে',
36017: "প্যাক টাইপ কোড ইতিমধ্যে বিদ্যমান।",
36018: 'প্যাক টাইপের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
36019: 'প্যাক টাইপের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
36020: 'আইটেমের তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

// PackJobService
36021: 'অনুরোধ ${currPlanningJOb.packJobNumber} বিদ্যমান নয়',
36022: 'অনুরোধ ${currPlanningJOb.packJobNumber} ইতিমধ্যে সম্পন্ন হয়েছে। আপনি এটি আনপ্ল্যান করতে পারবেন না',
36023: 'অনুরোধ সফলভাবে আনপ্ল্যান করা হয়েছে',
36024: 'কোনো চলমান বা সম্পন্ন প্যাক কাজের অনুরোধ পাওয়া যায়নি',
36025: 'প্যাক টেবিল সফলভাবে পরিকল্পিত হয়েছে',

36026: "আপনি একবারে শুধুমাত্র একটি অনুরোধ পরিকল্পনা করতে পারেন",
36027: "কোনো প্যাকজব পাওয়া যায়নি",
36028: "প্যাকজব ইতিমধ্যে প্যাকটেবিলের সাথে ম্যাপ করা হয়েছে",
36029: "প্রদত্ত টেবিল আইডি বিদ্যমান নেই",
36030: 'প্যাক কাজগুলো প্যাক টেবিলে পরিকল্পিত হয়েছে',

// PackingMaterialReqService
36031: 'প্যাক তালিকা সফলভাবে সংরক্ষণ করা হয়েছে',
36032: 'উপাদান অনুরোধ পাওয়া যায়নি',
36033: 'প্যাক উপাদান সফলভাবে পুনরুদ্ধার করা হয়েছে',
36034: 'কোনো আইটেম ম্যাপ করা হয়নি',
36035: 'প্যাক উপাদানের সংক্ষিপ্ত বিবরণ পুনরুদ্ধার করা হয়েছে',
36036: "অনুগ্রহ করে বৈধ উপাদান অনুরোধ আইডি প্রদান করুন",

// PackingMaterialReqInfoService
36038: 'প্রদত্ত প্যাক তালিকা আইডির সাথে কোনো ডেটা উপলব্ধ নেই',

// InspectionPreferenceService
36039: 'প্যাকলিস্ট পাওয়া যায়নি',
36040: 'সফলভাবে সংরক্ষিত হয়েছে',
36041: 'প্যাকিং তালিকার শিরোনাম পাওয়া যায়নি। অনুগ্রহ করে পরীক্ষা করুন।',
36042: 'পরিদর্শন সফলভাবে নিশ্চিত করা হয়েছে।',
36043: "পরিদর্শনের অপেক্ষমান উপকরণ সফলভাবে পুনরুদ্ধার করা হয়েছে",
36044: 'পরিদর্শনের অনুরোধ অবৈধ',
36045: 'পরিদর্শনের ধাপ ভুল। PENDING -> MATERIAL RECEIVED -> PROGRESS -> COMPLETED',

36046: 'পরিদর্শনের অনুরোধের অবস্থা সফলভাবে পরিবর্তিত হয়েছে',
36047: "অনুগ্রহ করে সমস্ত কার্টন নির্বাচন করুন",
36048: "পরিদর্শন সফলভাবে আপডেট করা হয়েছে",
36049: 'অনুরোধ বৈধ নয়',
36050: "প্রদত্ত ডেটার জন্য পরিদর্শন সম্পন্ন হয়েছে",
36051: "প্রদত্ত ডেটার জন্য পরিদর্শন সম্পন্ন হয়নি",

// PreIntegrationService
36052: 'অর্ডার সত্ত্বায় ডেটা সংরক্ষণ করতে ব্যর্থ',
36053: 'অর্ডার লাইন সত্ত্বায় ডেটা সংরক্ষণ করতে ব্যর্থ',
36054: 'অর্ডার লাইন গ্রুপ সত্ত্বায় ডেটা সংরক্ষণ করতে ব্যর্থ',
36055: 'PO ডেটা সফলভাবে সংরক্ষণ করা হয়েছে',
36056: 'PO ডেটা উপলব্ধ নয়',
36057: 'PO ডেটা সফলভাবে পুনরুদ্ধার করা হয়েছে',
36058: 'প্যাক অর্ডার ডেটা উপলব্ধ নয়',
36059: 'প্যাক সিরিয়াল সফলভাবে পুনরুদ্ধার করা হয়েছে',
36060: 'প্রদত্ত অর্ডার নম্বরের জন্য কোনো উপ-লাইন আইডি নেই',
36061: 'অর্ডারের উপ-লাইন আইডি',

36062: 'প্যাক অর্ডার ডেটা সফলভাবে পুনরুদ্ধার করা হয়েছে',
36063: 'প্যাক FG তথ্য সফলভাবে সংরক্ষণ করা হয়েছে',
36064: "প্যাক সিরিয়াল নম্বর সফলভাবে পুনরুদ্ধার করা হয়েছে",
36065: 'প্যাক অর্ডার বিদ্যমান নেই',
36066: 'প্যাক তালিকা বিদ্যমান: প্যাক অর্ডার মুছে ফেলা যাবে না',
36067: "প্যাক অর্ডার সফলভাবে মুছে ফেলা হয়েছে",

// PackingListInfoService
36068: 'কার্টন বিদ্যমান নেই',
36069: 'কার্টন তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

// PackListService
36070: 'প্যাক তালিকা সফলভাবে সংরক্ষণ করা হয়েছে',
36071: "ম্যাপিংয়ের জন্য কোনো FG নেই",
36072: 'প্যাক অর্ডার সফলভাবে মুছে ফেলা হয়েছে',
36073: 'ডেটা পাওয়া যায়নি',
36074: 'অনুরোধ পাওয়া যায়নি',
36075: 'প্যাক তালিকা ইতিমধ্যে অনুমোদিত।',
36076: 'প্রিন্ট অবস্থা সফলভাবে আপডেট করা হয়েছে',
36077: 'মুক্ত অবস্থা সফলভাবে আপডেট করা হয়েছে',

36078: 'প্রদত্ত বিশদ সহ কোনো প্যাক কাজ পাওয়া যায়নি',
36079: 'প্রদত্ত বারকোড সহ কোনো কার্টন পাওয়া যায়নি',
36080: "অনুগ্রহ করে বৈধ UPC প্রদান করুন",
36081: "এই FG পরিমাণ ইতিমধ্যে ম্যাপ করা হয়েছে",
36082: "আইটেম সফলভাবে আপডেট করা হয়েছে",
36083: '',
36084: 'নির্বাচিত বিক্রয় আদেশের জন্য কোনো প্যাক অর্ডার নেই',
36085: "অনুগ্রহ করে বৈধ FG লিখুন",
36086: "আপনি প্রয়োজনীয় পরিমাণের চেয়ে বেশি স্ক্যান করতে পারবেন না",
36087: "স্ক্যান সম্পন্ন হয়েছে",
36088: "এই বারকোডের বিরুদ্ধে কার্টন আছে",
36089: 'কার্টন তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
36090: 'কার্টন ওজন বিবরণ সফলভাবে পুনরুদ্ধার করা হয়েছে',

// FgRackDashboardService
36091: 'অবস্থান কার্টন তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',

// CartonContainerMappingService
36099: 'কার্টনগুলো কন্টেইনার থেকে মুক্ত করা হয়েছে',
36100: 'কার্টন আইডি প্রদান করা হয়নি',
36101: 'কার্টন নির্বাচিত কন্টেইনারের সাথে ম্যাপ করা হয়নি।',
36102: 'অনুগ্রহ করে কার্টন প্রবেশ করান',
36103: 'সর্বাধিক কন্টেইনার কার্টন ক্ষমতা সংজ্ঞায়িত নয়',
36104: 'প্যাক তালিকার জন্য কোনো কন্টেইনার গ্রুপ ম্যাপ করা হয়নি',
36105: 'কন্টেইনার গ্রুপ তথ্য সফলভাবে পুনরুদ্ধার করা হয়েছে',
}