export const PkdmsIntlMessageCodesBangla = {
// Pkdms → 41001-46000

//PkDispatchReadyInfoService
41001: 'DSetIds প্রদান করা হয়নি',
41002: 'কিছু Dispatch সেট আইডি নেই',
41003: 'কোনো DSetIds পাওয়া যায়নি',
41004: 'কোনো DSet SubItems আইডি পাওয়া যায়নি',
41005: 'কোনো DSetItemIds প্রদান করা হয়নি',
41006: 'কিছু সেট আইটেম আইডি নেই',
41007: '',
41008: 'Container মানচিত্রে কোনো রেকর্ড পাওয়া যায়নি',
41009: 'Container টেবিলে Container Ids পাওয়া যায়নি',

//PkDispatchReadyService
41010: "বারকোড প্রদান করা হয়নি",
41011: "কন্টেইনার বারকোড প্রদান করা হয়নি",
41012: 'কিছু সাব আইটেম পাওয়া যায়নি। প্রদানকৃত: ${barcodeArr.length}, বিদ্যমান: ${dSetSubItemRecs.length}',
41013: "কোনো কন্টেইনার পাওয়া যায়নি",
41014: 'বর্তমান CUT-এর সাথে কন্টেইনার ম্যাপ করা হয়নি',
41015: 'এই কন্টেইনারে ইতিমধ্যেই সাব আইটেম ম্যাপ করা হয়েছে',
41016: 'সাব আইটেম কন্টেইনার ম্যাপ সফলভাবে আপডেট করা হয়েছে',
41017: "বারকোড প্রদান করা হয়নি",
41018: "কোনো বারকোডই কোনো কন্টেইনারের সাথে ম্যাপ করা হয়নি",
41019: "সাব আইটেম কন্টেইনার ম্যাপ সফলভাবে আনম্যাপ করা হয়েছে",

//PkDispatchSetHelperService
41020: 'PKMS বলছে',

41021: 'OES বলছে',

//PkDispatchSetInfoService
41022: 'ডিসপ্যাচ আইডি প্রদান করা হয়নি',

41023: 'কিছু ডিসপ্যাচ সেট নেই',

41024: 'বিক্রয় আদেশ প্রদান করা হয়নি',
41025: 'প্রদত্ত বিক্রয় আদেশের জন্য কোনো ডিসপ্যাচ সেট নেই',

41026: 'সেট আইডির জন্য কোনো আইটেম পাওয়া যায়নি: ',

//PkDispatchSetService
41027: 'অনুগ্রহ করে কাট নম্বর নির্বাচন করুন',
41028: 'কিছু নির্বাচিত আইটেমের জন্য ইতিমধ্যেই ডিসপ্যাচ সেট তৈরি করা হয়েছে',
41029: 'S.O পাওয়া যায়নি',
41030: 'ডিসপ্যাচ সেট সফলভাবে তৈরি করা হয়েছে',
41031: 'অনুগ্রহ করে ডিসপ্যাচ সেট আইডি প্রদান করুন',
41032: 'প্রদত্ত তথ্যের জন্য কোনো ডিসপ্যাচ সেট নেই',
41033: 'কিছু আইটেমের জন্য ইতিমধ্যেই শিপিং অনুরোধ তৈরি করা হয়েছে',
41034: `নির্বাচিত সেটগুলোর কিছু সম্পর্কিত আইটেম ইতিমধ্যে প্যাক করা হয়েছে`,
41035: 'কাট ডিসপ্যাচ অনুরোধ সফলভাবে মুছে ফেলা হয়েছে',

41036: "সাব আইটেম প্রিন্ট স্ট্যাটাস সফলভাবে আপডেট করা হয়েছে",

41037: "কন্টেইনার আইডি পাওয়া যায়নি",
41038: "কন্টেইনার প্রিন্ট স্ট্যাটাস সফলভাবে আপডেট করা হয়েছে",

41039: "সাব আইটেম প্রিন্ট স্ট্যাটাস সফলভাবে মুক্ত করা হয়েছে",

41040: "কন্টেইনার আইডি পাওয়া যায়নি",
41041: "কন্টেইনার প্রিন্ট স্ট্যাটাস সফলভাবে মুক্ত করা হয়েছে",

//PkShippingRequestHelperService
41042: 'প্রদত্ত আইডির জন্য কোনো বিক্রেতা নেই',

//PkShippingRequestInfoService
41043: 'অনুগ্রহ করে শিপিং অনুরোধ আইডি প্রদান করুন',
41044: 'প্রদত্ত মানদণ্ডের জন্য কোনো শিপিং অনুরোধ নেই',

41045: 'অনুগ্রহ করে বিক্রয় আদেশ প্রদান করুন',
// Pkdms → 41001-46000

//PkDispatchReadyInfoService
41046: 'শিপিং অনুরোধ আইডির জন্য কোনো শিপিং আইটেম পাওয়া যায়নি',
41047: 'শিপিং অনুরোধ আইডির জন্য কোনো ট্রাক তথ্য আপডেট করা হয়নি',
41048: 'শিপিং অনুরোধ আইডির জন্য কোনো বিক্রেতা ম্যাপ করা হয়নি',
41049: 'sRequest আইটেম আইডির জন্য কোনো আইটেম বৈশিষ্ট্য নেই',
41050: 'কোনো শিপিং আইটেম পাওয়া যায়নি',
41051: 'AOD সারসংক্ষেপ তথ্য পাওয়া গেছে',
41052: 'ডিসপ্যাচ করা ডেটা সফলভাবে পাওয়া গেছে',
41054: "অনুগ্রহ করে dSet আইটেম আইডি প্রদান করুন",

//PkDispatchSetService
41055: "dSet সাব আইটেম আইডি পাওয়া যায়নি",
41056: 'শিপিং তথ্য পাওয়া গেছে',
41057: 'প্রদত্ত মানদণ্ডের জন্য কোনো শিপিং অনুরোধ পাওয়া যায়নি',
41058: 'আইডি প্রদান করা আবশ্যক',
41059: 'কিছু রেকর্ড নেই। পৃষ্ঠা রিফ্রেশ করে পুনরায় চেষ্টা করুন',
41060: 'কিছু আইটেমের জন্য ইতিমধ্যে শিপিং অনুরোধ তৈরি করা হয়েছে',
41061: 'ডিসপ্যাচ আইডির জন্য ডিসপ্যাচ সাব আইটেম পাওয়া যায়নি:',
41062: 'শিপিং সফলভাবে তৈরি করা হয়েছে',
41063: 'অনুগ্রহ করে শিপিং অনুরোধ আইডি প্রদান করুন',
41064: 'কিছু শিপিং অনুরোধ ইতিমধ্যে অনুমোদিত হয়েছে। কোনো পরিবর্তন করা যাবে না',
41065: 'শিপিং বিক্রেতা আইডি পাওয়া যায়নি',
41066: 'শিপিং বিক্রেতা আইডি সফলভাবে মুছে ফেলা হয়েছে',
41067: 'শিপিং বিক্রেতা আইডি প্রদান করা হয়নি',
41068: 'শিপিং অনুরোধ বিদ্যমান নেই',
41069: 'কিছু শিপিং অনুরোধ ইতিমধ্যে অনুমোদিত হয়েছে। কোনো পরিবর্তন করা যাবে না',
41070: 'বিক্রেতার তথ্য সফলভাবে আপডেট করা হয়েছে',
41071: 'অনুগ্রহ করে ট্রাক আইডি প্রদান করুন',
41072: 'ট্রাক আইডি পাওয়া যায়নি',
41073: 'ট্রাক আইডি সফলভাবে মুছে ফেলা হয়েছে',
41074: 'শিপিং অনুরোধ আইডি প্রদান করা হয়নি',
41075: 'আইডির জন্য কোনো শিপিং অনুরোধ পাওয়া যায়নি:',
41076: 'সফলভাবে তৈরি করা হয়েছে',
41077: 'অনুগ্রহ করে শিপিং অনুরোধ আইডি প্রদান করুন',
41078: 'কোনো শিপিং অনুরোধ পাওয়া যায়নি',
41079: 'কিছু শিপিং অনুরোধ ইতিমধ্যে অনুমোদিত এবং মুছে ফেলা যাবে না',
41080: 'শিপিং অনুরোধ(গুলি) সফলভাবে মুছে ফেলা হয়েছে',

41082: 'শিপিং সেট আইডি: ${srId} বিদ্যমান নেই',
41083: 'শিপিং আইডি: ${srId} খোলা নেই',
41084: 'বিক্রেতার তথ্য আপডেট করা হয়নি। অনুমোদনের আগে আপডেট করুন',

41087: 'শিপিং আইডি: ${srId} বিদ্যমান নেই',

41090: "অনুগ্রহ করে শিপিং অনুরোধ আইডি প্রদান করুন",
41091: "অনুগ্রহ করে ট্রাকের বহির্গমন সময় প্রদান করুন",
41092: "শিপিং অনুরোধ পাওয়া যায়নি",
41100: 'শিপিং অনুরোধ ইতিমধ্যে ডিসপ্যাচ করা হয়েছে',
41094: 'শিপিং অনুরোধের জন্য কোনো ট্রাক ম্যাপ করা হয়নি',
41095: "শিপিং অনুরোধ সফলভাবে ডিসপ্যাচ করা হয়েছে",

41098: 'শিপিং প্রসেসিং আইডি: ${srId} বিদ্যমান নেই',
41099: 'শিপিং আইডি: ${srId} ডিসপ্যাচ বিভাগ থেকে অনুমোদিত হয়নি',

41102: "শিপিং অনুরোধ ডিসপ্যাচ করা যাবে",

//ShippingRequestService
41103: 'আইডি প্রদান করা আবশ্যক',
41104: 'কিছু রেকর্ড নেই। পৃষ্ঠা রিফ্রেশ করে পুনরায় চেষ্টা করুন',
41105: 'কিছু আইটেমের জন্য ইতিমধ্যে শিপিং অনুরোধ তৈরি করা হয়েছে',
41106: 'ডিসপ্যাচ আইডির জন্য ডিসপ্যাচ সাব আইটেম পাওয়া যায়নি:',
41107: 'শিপিং সফলভাবে তৈরি করা হয়েছে',
41108: 'অনুগ্রহ করে শিপিং অনুরোধ আইডি প্রদান করুন',
41109: 'কিছু শিপিং অনুরোধ ইতিমধ্যে অনুমোদিত হয়েছে। কোনো পরিবর্তন করা যাবে না',
41110: 'শিপিং বিক্রেতা আইডি পাওয়া যায়নি',
41111: 'শিপিং বিক্রেতা আইডি সফলভাবে মুছে ফেলা হয়েছে',
41112: 'শিপিং বিক্রেতা আইডি প্রদান করা হয়নি',
41113: 'শিপিং অনুরোধ বিদ্যমান নেই',

41115: 'বিক্রেতার তথ্য সফলভাবে আপডেট করা হয়েছে',
41116: 'অনুগ্রহ করে ট্রাক আইডি প্রদান করুন',
41117: 'ট্রাক আইডি পাওয়া যায়নি',
41118: 'ট্রাক আইডি সফলভাবে মুছে ফেলা হয়েছে',
41119: 'সফলভাবে তৈরি করা হয়েছে',

41121: 'কোনো শিপিং অনুরোধ পাওয়া যায়নি',
41122: 'কিছু শিপিং অনুরোধ ইতিমধ্যে অনুমোদিত এবং মুছে ফেলা যাবে না',
41123: 'শিপিং অনুরোধ(গুলি) সফলভাবে মুছে ফেলা হয়েছে',
41124: 'শিপিং সেট আইডি: ${srId} বিদ্যমান নেই',
41125: 'বিক্রেতার তথ্য আপডেট করা হয়নি। অনুমোদনের আগে আপডেট করুন',

41126: 'শিপিং আইডি: ${srId} বিদ্যমান নেই',

41127: "অনুগ্রহ করে ট্রাকের বহির্গমন সময় প্রদান করুন",
41128: 'শিপিং অনুরোধের জন্য কোনো ট্রাক ম্যাপ করা হয়নি',
41129: 'মোট শিপিং সাব আইটেম: ${totalSubItemsForSr}। শুধুমাত্র ${totalPutInBagItems} ব্যাগে রাখা হয়েছে। চেকআউটের আগে সব আইটেম ব্যাগে রাখুন',
41130: "শিপিং অনুরোধ সফলভাবে ডিসপ্যাচ করা হয়েছে"

















}